hiperiondev/esp32idf_APRS/main/app_config.c
// @file app_config.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief Persistent application configuration: defaults, the per-functionality
// JSON files on LittleFS (via cJSON) and the global g_config instance shared by
// every component and web admin page.
//
// The configuration is stored as one file per web admin functionality -
// /storage/system.json, station.json, wireless.json, radio.json, igate.json,
// brandmeister.json, digi.json, tracker.json, weather.json, gps.json,
// message.json, winlink.json and query.json - each described by one row of the
// SECTIONS table below, which names the file and the two halves of its codec.
// A page saves only the file or files it edits; app_config_load() reads them
// all and creates from the factory defaults any that are absent, so every
// functionality always has a file on flash.

#include <float.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h> // strtod() - shortest round-tripping precision for the JSON number writer
#include <string.h>

#include "app_config.h"
#include "aprs_coord.h" // aprs_symbol_table_is_valid()/aprs_symbol_code_is_valid(): the symbol pair accepted on air
// RF_TX_BUFFERS_MIN/MAX, RF_PREAMBLE_MS_MIN/MAX, RF_TX_TIMESLOT_MS_MAX,
// PTT_MIN_UNKEY_MS_MAX, CSMA_PERSIST_MIN: the same bounds the Radiomodem form
// enforces, so what is loaded from flash and what is saved from the web admin
// can never accept different values.
#include "aprs_service.h"
#include "cJSON.h"
// MODEM_PTT_ACTIVE_HIGH: the board's PTT polarity, #ifndef-guarded in that
// header and overridden from the top-level CMakeLists.txt. Both it and
// MODEM_PTT_GPIO (the PTT pin itself) are fixed compile-time constants with
// no g_config counterpart - see aprs_service_build_modem_config().
#include "esp32idf_radioamateur_modem_config.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "heap_monitor.h"  // HEAP_MONITOR_BRACKET() - the parse tree here is one of the larger transients
#include "json_escape.h"   // json_write_escaped()
#include "json_store.h"    // shared JSON-file store scaffolding
#include "sensors_local.h" // sensors_local_channel_name() / _from_name() - WX field mappings are stored by driver name, not registry index
#include "storage.h"       // storage_write_lock() - keeps a save from overlapping a whole-partition format
#include "str_append.h"    // str_copy_utf8_safe()
#include "time_sync.h"     // time_sync_tz_count() - bounds g_config.timezone_idx on load

static const char *TAG = "app_config";

app_config_t g_config;

// Serializes every save/load of the section files. Without
// this, two overlapping POSTs (e.g. a user clicking Save twice quickly, or a
// page auto-refresh racing a save) could both end up inside
// app_config_save() at once, doing redundant work and each rewriting the
// live config from under the other. (Note: esp_littlefs already takes a
// per-instance lock around every VFS op, so overlapping saves cannot corrupt
// the filesystem's own metadata, and the stdio buffer allocation that a save
// would otherwise make on its first write is handled separately - see
// json_store_open_tmp(). This mutex is here because serializing saves is
// correct on its own terms: it avoids wasted flash writes and it is what lets
// a save reuse a single static stdio buffer.) Created lazily so this file has
// no init-order dependency. The handle is read and written with
// __atomic_load_n()/__atomic_store_n() so every caller, including the one
// outside the critical section, sees either NULL or a fully constructed
// semaphore, never a partially published pointer.
//
// Returns NULL when the heap had no room for the mutex: every caller tests
// the handle before using it, so an out-of-memory device reports a failed save
// instead of taking a NULL handle, which aborts the calling task.
static SemaphoreHandle_t s_config_mutex = NULL;

static SemaphoreHandle_t config_mutex(void) {
    SemaphoreHandle_t m = __atomic_load_n(&s_config_mutex, __ATOMIC_ACQUIRE);
    if (!m) {
        // Allocated before the critical section is entered, so the heap walk
        // never runs with interrupts masked; the critical section only ever
        // publishes the winning handle. A concurrent loser's candidate is
        // freed once outside the lock.
        SemaphoreHandle_t candidate = xSemaphoreCreateMutex();
        static portMUX_TYPE creation_lock = portMUX_INITIALIZER_UNLOCKED;
        taskENTER_CRITICAL(&creation_lock);
        m = s_config_mutex;
        if (!m) {
            m = candidate;
            candidate = NULL;
            __atomic_store_n(&s_config_mutex, m, __ATOMIC_RELEASE);
        }
        taskEXIT_CRITICAL(&creation_lock);
        if (candidate)
            vSemaphoreDelete(candidate);
    }
    return m;
}

// Short-held lock guarding concurrent access to the live g_config struct
// itself. Distinct from s_config_mutex above (which is held across the entire
// flash serialization in app_config_save() and would stall readers): this one
// is a strict LEAF lock, only ever held long enough to mutate/copy a few
// fields. See the app_config_lock() contract in app_config.h. Created lazily
// with the same one-time-init guard as config_mutex(), and NULL under the same
// out-of-memory condition. The handle is read and written with
// __atomic_load_n()/__atomic_store_n() so every caller, including the one
// outside the critical section, sees either NULL or a fully constructed
// semaphore, never a partially published pointer.
static SemaphoreHandle_t s_data_mutex = NULL;

