hiperiondev/esp32idf_APRS/main/app_config.c
static SemaphoreHandle_t data_mutex(void) {
    SemaphoreHandle_t m = __atomic_load_n(&s_data_mutex, __ATOMIC_ACQUIRE);
    if (!m) {
        // Allocated before the critical section is entered, so the heap walk
        // never runs with interrupts masked; the critical section only ever
        // publishes the winning handle. A concurrent loser's candidate is
        // freed once outside the lock.
        SemaphoreHandle_t candidate = xSemaphoreCreateMutex();
        static portMUX_TYPE creation_lock = portMUX_INITIALIZER_UNLOCKED;
        taskENTER_CRITICAL(&creation_lock);
        m = s_data_mutex;
        if (!m) {
            m = candidate;
            candidate = NULL;
            __atomic_store_n(&s_data_mutex, m, __ATOMIC_RELEASE);
        }
        taskEXIT_CRITICAL(&creation_lock);
        if (candidate)
            vSemaphoreDelete(candidate);
    }
    return m;
}

void app_config_lock(void) {
    // A device that could not allocate the mutex runs unserialized rather than
    // aborting on a NULL handle: the same trade storage.c's writer gate makes,
    // and the only alternative on a heap too small to hold one semaphore.
    SemaphoreHandle_t m = data_mutex();
    if (m)
        xSemaphoreTake(m, portMAX_DELAY);
}

void app_config_unlock(void) {
    SemaphoreHandle_t m = __atomic_load_n(&s_data_mutex, __ATOMIC_ACQUIRE);
    if (m)
        xSemaphoreGive(m);
}

// Every stored string in app_config_t passes through here, so this is the
// one place a CR or LF typed or pasted into any web-admin field - callsign,
// hostname, filter spec, comment, status, path, anything - is stripped
// before it reaches flash. Every consumer of these fields later writes them
// into a line-oriented output (APRS-IS, the AX.25 TNC2 text form, the JSON
// config file itself), and none of those escape an embedded line break, so
// filtering it out at the point of storage closes the path regardless of
// which field carried it or which output it was eventually written to.
static void set_str(char *dst, size_t sz, const char *val) {
    str_copy_strip_line_breaks(val, dst, sz);
}

// Loads a stored free-text field the same way set_str() loads every other
// stored string, except that the cut is walked back to a whole character
// instead of a whole byte. Reserved for the handful of fields that are
// 8-bit-clean and repeated on the air unchanged (comment and status text,
// per aprs.org/aprs12/utf-8.txt) - every other set_str() call is a coded or
// structured field (callsign, hostname, filter spec, ...) that is
// effectively ASCII, where a byte cut and a character cut always land in the
// same place.
//
// CR and LF are stripped first, into a scratch buffer sized to the largest
// field set_str_utf8() serves (COMMENT_SIZE): both are single-byte ASCII,
// never a lead or continuation byte of a multi-byte UTF-8 sequence, so
// removing them ahead of the UTF-8-safe cut cannot itself split a character,
// and doing so here gives this path the same line-break guarantee set_str()
// gives every other stored string. The UTF-8-safe cut then runs from the
// scratch buffer into dst to enforce the byte budget.
static void set_str_utf8(char *dst, size_t sz, const char *val) {
    char stripped[COMMENT_SIZE];
    str_copy_strip_line_breaks(val, stripped, sizeof(stripped) < sz ? sizeof(stripped) : sz);
    str_copy_utf8_safe(stripped, dst, sz);
}

void app_config_set_defaults(app_config_t *c) {
    memset(c, 0, sizeof(*c));

    c->synctime = true;
    c->cpuFreq = 240;
    c->timezone_idx = 0; // UTC

    set_str(c->my_callsign, sizeof(c->my_callsign), "NOCALL");
    // Coordinates start at 0/0 and are transmitted as they stand. APRS has no
    // "position unknown" form, so a station that beacons before the operator
    // sets these puts a real position in the Gulf of Guinea on the air; the
    // placeholder callsign above is what keeps that from being mistaken for a
    // licensed station.
    c->my_lat = 0.0f;
    c->my_lon = 0.0f;
    c->my_alt = 0.0f;

    c->my_phg_power = 1;
    c->my_phg_gain = 6.0f;
    c->my_phg_height = 10;
    c->my_phg_dir = 0;

    c->pos_ambiguity = 0;
    c->status_grid_en = false;
    c->status_timestamp_en = false;
    c->status_beam_deg = STATUS_BEAM_DEG_OFF;
    c->status_erp_watts = 0;
    c->my_no_archive = false;
    c->pos_dao_en = false;

    // SoftAP only: an unconfigured device has no station credentials to use,
    // and the AP is what makes the web admin reachable out of the box.
    c->wifi_mode = WIFI_MODE_CFG_DEFAULT;
    c->wifi_power = WIFI_TX_POWER_DBM_DEFAULT;
    for (int i = 0; i < WIFI_STA_NUM; i++) {
        c->wifi_sta[i].enable = false;
        set_str(c->wifi_sta[i].wifi_ssid, sizeof(c->wifi_sta[i].wifi_ssid), "WIFI_AP");
        set_str(c->wifi_sta[i].wifi_pass, sizeof(c->wifi_sta[i].wifi_pass), "");
    }
    c->wifi_ap_ch = WIFI_AP_CH_DEFAULT;
    set_str(c->wifi_ap_ssid, sizeof(c->wifi_ap_ssid), "esp32idf_APRS");
    set_str(c->wifi_ap_pass, sizeof(c->wifi_ap_pass), "esp32idf_APRS");

    // IGATE
    c->igate_en = true;
    c->rf2inet = true;
    c->inet2rf = false;
    c->igate_loc2rf = false;
    c->igate_loc2inet = true;
    c->aprs_ssid = 10;
    set_str(c->aprs_mycall, sizeof(c->aprs_mycall), "NOCALL");
    set_str(c->aprs_passcode, sizeof(c->aprs_passcode), "-1");
    // Only slot 0 is enabled by default, so a station that never opens the
    // server list behaves as a plain single-server IGate; the other three
    // slots stay disabled until the operator opts into failover.
    c->aprs_server[0].enable = true;
    set_str(c->aprs_server[0].host, sizeof(c->aprs_server[0].host), "aprs.dprns.com");
    c->aprs_server[0].port = APRS_PORT_DEFAULT;
    for (int i = 1; i < APRS_SERVER_NUM; i++) {
        c->aprs_server[i].enable = false;
        set_str(c->aprs_server[i].host, sizeof(c->aprs_server[i].host), "aprs.dprns.com");
        c->aprs_server[i].port = APRS_PORT_DEFAULT;
    }
    set_str(c->aprs_filter, sizeof(c->aprs_filter), "");
    c->igate_log_after_filters = false;
    c->igate_bcn = true;
    c->igate_lat = 0.000f;
    c->igate_lon = 0.000f;
    c->igate_alt = 0;
    c->igate_interval = 30;
    set_str(c->igate_symbol, sizeof(c->igate_symbol), "N&");
    // Preset-slot mask over path[0..3], not a service mask: bit 0 is the
    // only slot that ships with a path string.
    c->igate_path = PATH_PRESET_MASK_DEFAULT;
    set_str(c->igate_comment, sizeof(c->igate_comment), "esp32idf_APRS IGate");
    c->igate_sts_interval = 0;
    c->igate_compress = false;
    c->igate_phg_enable = false;
    c->igate_phg_use_station = false;
    c->igate_phg_power = 1;
    c->igate_phg_gain = 6.0f;
    c->igate_phg_height = 10;
    c->igate_phg_dir = 0;
    c->igate_ext_type = APRS_EXT_PHG;
    c->igate_range_miles = 0;
    c->igate_dfs_strength = 0;
    c->igate_df_bearing = 0;
    // A DF report whose N digit is 0 states that the NRQ triplet carries no
    // meaning, which is the honest reading until the operator enters one.
    c->igate_df_nrq_n = 0;
    c->igate_df_nrq_r = 0;
    c->igate_df_nrq_q = 0;
    c->igate_freq_mhz = 0.0f;
    c->igate_tone_tenths = 0;
    c->igate_duplex = 0;
    c->igate_offset_khz = 0;
    c->rf2inetFilter = IGATE_FILT_MESSAGE | IGATE_FILT_STATUS | IGATE_FILT_TELEMETRY | IGATE_FILT_WEATHER | IGATE_FILT_OBJECT | IGATE_FILT_ITEM |
                       IGATE_FILT_BUOY | IGATE_FILT_POSITION | IGATE_FILT_OTHER;
    c->inet2rfFilter = IGATE_FILT_MESSAGE;
    c->rf2inet_budlist_mode = BUDLIST_OFF;
    c->inet2rf_budlist_mode = BUDLIST_OFF;
    for (int i = 0; i < IGATE_BUDLIST_MAX; i++)
        set_str(c->budlist[i], sizeof(c->budlist[i]), "");

    // Satellite/ISS digipeater gate-call list: the same 6 calls this firmware
    // always used before this list became web-configurable. Remaining slots
    // (if IGATE_SATGATE_MAX ever grows past 6) default to empty/unused.
    {
        static const char *satGateDefaults[] = { "RS0ISS", "YBOX", "YBSAT", "PSAT", "W3ADO", "BJ1SI" };
        for (int i = 0; i < IGATE_SATGATE_MAX; i++)
            set_str(c->satgate[i], sizeof(c->satgate[i]), (i < (int)(sizeof(satGateDefaults) / sizeof(satGateDefaults[0]))) ? satGateDefaults[i] : "");
    }
    c->dup_cache_size = DUP_CACHE_SIZE_DEFAULT;
    c->dup_cache_timeout_ms = DUP_CACHE_TIMEOUT_MS_DEFAULT;

