hiperiondev/esp32idf_APRS/main/app_config.c
    c->rf2inet_range_en = false;
    c->rf2inet_range_km = 0.0f;
    c->rf2inet_prefix_en = false;
    set_str(c->rf2inet_prefixes, sizeof(c->rf2inet_prefixes), "");
    c->inet2rf_range_en = false;
    c->inet2rf_range_km = 0.0f;

    // BrandMeister interconnect: off, and with the worldwide monitor
    // subscription off inside it. Both are opt-in because the feature changes
    // what the station puts on the air, and the gateway list starts empty
    // because the two tests that matter (TOCALL and the DMR alias) need no
    // configuration at all - see aprs_bm.h.
    c->bm_en = false;
    c->bm_monitor = false;
    c->bm_msg_inet_only = true;
    for (int i = 0; i < APRS_BM_GATEWAYS_MAX; i++)
        set_str(c->bm_gateways[i], sizeof(c->bm_gateways[i]), "");
    c->inet2rf_3rdparty_unwrap_en = false;
    c->igate_msg_gate_en = true;
    c->igate_local_window_sec = IGATE_LOCAL_WINDOW_SEC_DEFAULT;
    // Message gating reaches exactly as far as the IGate transmits: an addressee
    // whose frames arrive over a longer path than this station can send back is
    // out of reach whatever the last-heard window says. PATH_PRESET_MASK_DEFAULT
    // above selects preset slot 0 alone, and that slot is filled with
    // PATH_PRESET_DEFAULT, so the reach of the factory transmit path is the hop
    // count of that one string.
    c->igate_msg_max_hops = app_config_path_preset_hops(PATH_PRESET_DEFAULT);
    if (c->igate_msg_max_hops > IGATE_MSG_MAX_HOPS_MAX)
        c->igate_msg_max_hops = IGATE_MSG_MAX_HOPS_MAX;

    // DIGI
    c->digi_en = false;
    c->digi_ssid = 1;
    set_str(c->digi_mycall, sizeof(c->digi_mycall), "NOCALL");
    c->digi_path = PATH_PRESET_MASK_DEFAULT; // preset-slot mask over path[0..3], not a service mask
    c->digi_bcn = true;
    c->digi_compress = false;
    c->digi_interval = 30;
    set_str(c->digi_symbol, sizeof(c->digi_symbol), "N&");
    set_str(c->digi_comment, sizeof(c->digi_comment), "esp32idf_APRS Digi");
    c->digi_phg_enable = false;
    c->digi_phg_use_station = false;
    c->digi_phg_power = 1;
    c->digi_phg_gain = 6.0f;
    c->digi_phg_height = 10;
    c->digi_phg_dir = 0;
    c->digi_ext_type = APRS_EXT_PHG;
    c->digi_range_miles = 0;
    c->digi_dfs_strength = 0;
    c->digi_df_bearing = 0;
    // A DF report whose N digit is 0 states that the NRQ triplet carries no
    // meaning, which is the honest reading until the operator enters one.
    c->digi_df_nrq_n = 0;
    c->digi_df_nrq_r = 0;
    c->digi_df_nrq_q = 0;
    c->digi_freq_mhz = 0.0f;
    c->digi_tone_tenths = 0;
    c->digi_duplex = 0;
    c->digi_offset_khz = 0;

    // Factory alias table: the New n-N Paradigm's two standard aliases get a
    // row each so their hop limits can differ, and a wildcard row catches the
    // rest of the WIDEn family and traps it down to two hops. Every row traces
    // (inserts this station's callsign), which is what makes each hop of a
    // repeated path identifiable. The fourth row is free for a regional
    // SSn-N alias.
    {
        static const digi_alias_t aliasDefaults[] = {
            { "WIDE1", 1, DIGI_ALIAS_TRACE },
            { "WIDE2", 2, DIGI_ALIAS_TRACE },
            { "WIDE#", 2, DIGI_ALIAS_TRACE },
            { "", 1, DIGI_ALIAS_OFF },
        };
        for (int i = 0; i < DIGI_ALIAS_MAX; i++) {
            if (i < (int)(sizeof(aliasDefaults) / sizeof(aliasDefaults[0]))) {
                c->digi_alias[i] = aliasDefaults[i];
            } else {
                set_str(c->digi_alias[i].alias, sizeof(c->digi_alias[i].alias), "");
                c->digi_alias[i].max_n = 1;
                c->digi_alias[i].mode = DIGI_ALIAS_OFF;
            }
        }
    }
    c->digi_fillin_only = false;
    c->digi_trap_n_clamp = true;
    // Routing on the destination SSID alone is pre-New-N behaviour that
    // bypasses the alias table entirely, so it stays off until an operator who
    // still has a legacy neighbour asks for it.
    c->digi_dest_ssid_en = false;
    // Scanning past the first unused address changes which stations this
    // digipeater answers for, so it is opt-in: a station that has not been
    // asked to serve an explicit route behaves exactly as the alias table says.
    c->digi_preempt = DIGI_PREEMPT_OFF;

    // TRACKER
    c->trk_en = false;
    c->trk_ssid = 9;
    set_str(c->trk_mycall, sizeof(c->trk_mycall), "NOCALL");
    c->trk_path = PATH_PRESET_MASK_DEFAULT; // preset-slot mask over path[0..3], not a service mask
    c->trk_interval = 60;
    c->trk_compress = false;
    c->trk_phg_enable = false;
    c->trk_mice = false;
    c->trk_mice_msg = MICE_POS_COMMENT_DEFAULT;
    set_str(c->trk_symbol, sizeof(c->trk_symbol), "\\>");
    set_str(c->trk_comment, sizeof(c->trk_comment), "esp32idf_APRS Tracker");
    c->trk_freq_mhz = 0.0f;
    c->trk_tone_tenths = 0;
    c->trk_duplex = 0;
    c->trk_offset_khz = 0;

    // SmartBeaconing (Hans-Gunnar Lundahl / HamHUD algorithm), off by
    // default: an operator has to opt in and also enable "Use live GPS fix",
    // since neither speed nor course exists without a live fix.
    c->trk_sb_enable = false;
    c->trk_sb_slow_interval = TRK_SB_SLOW_INTERVAL_S_DEFAULT;
    c->trk_sb_fast_interval = TRK_SB_FAST_INTERVAL_S_DEFAULT;
    c->trk_sb_low_speed_kmh = TRK_SB_LOW_SPEED_KMH_DEFAULT;
    c->trk_sb_high_speed_kmh = TRK_SB_HIGH_SPEED_KMH_DEFAULT;
    c->trk_sb_turn_angle = TRK_SB_TURN_ANGLE_DEFAULT;
    c->trk_sb_turn_slope = TRK_SB_TURN_SLOPE_DEFAULT;
    c->trk_sb_min_turn_time = TRK_SB_MIN_TURN_TIME_S_DEFAULT;

    // GNSS receiver
    c->gps_en = false;

    // WX
    c->wx_en = false;
    c->wx_ssid = 13;
    set_str(c->wx_mycall, sizeof(c->wx_mycall), "NOCALL");
    c->wx_path = PATH_PRESET_MASK_DEFAULT; // preset-slot mask over path[0..3], not a service mask
    c->wx_interval = 300;
    set_str(c->wx_comment, sizeof(c->wx_comment), APRS_SOFTWARE_NAME " WX");
    // Enable the WX fields a typical station reports; the rest stay off until
    // the operator maps a sensor channel to them on the Weather page.
    //
    // wx_sensor_ch[] defaults to SENSOR_LOCAL_CH_NONE ("(none)" - see page_wx.c's
    // wx_channel_select()/wx_field_present() and weather.c's
    // weather_refresh_now(), which both treat it as "no source channel
    // picked"). Channel 0 is a REAL registry slot (the first registered
    // driver), not a placeholder, so defaulting to 0 here would wire the
    // fields below straight to whatever driver happened to enumerate first -
    // transmitting live sensor data on first boot even though the operator
    // never mapped a channel in Sensor Mapping. Enable/Averaged/Channel must
    // all be explicitly set by the operator before a field is ever sampled or
    // put on-air; only Channel needs the non-zero default to make that true,
    // since weather_refresh_now() already skips any field whose channel is
    // SENSOR_LOCAL_CH_NONE regardless of its Enable bit.
    for (int i = 0; i < WX_SENSOR_NUM; i++) {
        c->wx_sensor_enable[i] = false;
        c->wx_sensor_avg[i] = false;
        c->wx_sensor_ch[i] = SENSOR_LOCAL_CH_NONE;
    }
    c->wx_sensor_enable[WX_FIELD_WIND_DIRECTION] = true;
    c->wx_sensor_enable[WX_FIELD_WIND_SPEED] = true;
    c->wx_sensor_enable[WX_FIELD_WIND_GUST] = true;
    c->wx_sensor_enable[WX_FIELD_TEMPERATURE] = true;
    c->wx_sensor_enable[WX_FIELD_HUMIDITY] = true;
    c->wx_sensor_enable[WX_FIELD_PRESSURE] = true;

