hiperiondev/esp32idf_APRS/main/app_config.c
    // Telemetry defaults live in telemetry_config_set_defaults()
    // (telemetry.c); telemetry configuration is not part of g_config.

    // AFSK / TNC
    c->audio_modem_en = true;
    c->audio_lpf = true;
    c->preamble = 300;
    c->afsk_modem_type = 1; // default 1200 Bd (AFSK/Bell202) - standard APRS audio modem
    c->fx25_mode = 0;
    c->tx_timeslot = 2000;
    c->csma_persist = 63;     // ~25% transmit chance per clear slot, the standard AX.25/KISS Persist default
    c->rf_tx_buffers = 1;     // see RF_TX_BUFFERS_MIN/MAX in aprs_service.h
    c->duty_cycle_en = false; // long-term duty-cycle limiter off by default (opt-in) - see DUTY_CYCLE_PCT_MIN/MAX in aprs_service.h
    c->duty_cycle_pct = 25;   // ceiling once enabled: 25% of the rolling window aprs_service.c measures it over
    c->ptt_min_unkey_ms = 0;  // see PTT_MIN_UNKEY_MS_MIN/MAX in aprs_service.h
    set_str(c->ntp_host[0], sizeof(c->ntp_host[0]), "pool.ntp.org");
    set_str(c->ntp_host[1], sizeof(c->ntp_host[1]), "time.google.com");
    set_str(c->ntp_host[2], sizeof(c->ntp_host[2]), "time.cloudflare.com");
    c->ntp_resync_sec = 3600;

    // System / HTTP auth  (README documented default: admin/admin)
    set_str(c->http_username, sizeof(c->http_username), "admin");
    set_str(c->http_password, sizeof(c->http_password), "admin");
    // Shared path presets. Slot 0 carries the generic New n-N Paradigm path and
    // is the slot every beacon selects out of the box (PATH_PRESET_MASK_DEFAULT);
    // the other three are free for the operator's regional aliases.
    for (int i = 0; i < 4; i++)
        set_str(c->path[i], sizeof(c->path[i]), "");
    set_str(c->path[0], sizeof(c->path[0]), PATH_PRESET_DEFAULT);

    // Audio modem PTT.
    //
    // The modem component takes its ADC/DAC pins, PTT pin, PTT active level,
    // ADC attenuation and LED pins as compile-time constants (MODEM_* macros,
    // set in the top-level CMakeLists.txt). None of them is a g_config field -
    // see aprs_service_build_modem_config().

    // Message
    c->msg_enable = true;
    set_str(c->msg_mycall, sizeof(c->msg_mycall), "NOCALL");
    c->msg_path = 9;
    c->msg_rf = true;
    c->msg_inet = true;
    c->msg_retry = 3;
    c->msg_interval = 30;
    c->msg_alarm_enable = false; // disabled by default
    c->msg_alarm_gpio = -1;
    for (int i = 0; i < 3; i++)
        c->msg_group[i][0] = 0; // no operator-defined groups by default

    // Winlink (APRSLink). Opt-in: the client needs an account and a password
    // before it can do anything, so it stays off until the operator has
    // entered both.
    c->wl_enable = false;
    set_str(c->wl_service_call, sizeof(c->wl_service_call), WL_SERVICE_CALL_DEFAULT);
    c->wl_password[0] = 0;
    c->wl_use_msg_call = true;
    c->wl_mycall[0] = 0;
    c->wl_auto_login = true;
    c->wl_session_max_min = WL_SESSION_MAX_MIN_DEFAULT;
    c->wl_poll_min = 0;
    c->wl_comment_en = false;
    // This station is its own IGate, so its own Winlink traffic has no reason
    // to occupy the local channel.
    c->wl_inet_only = true;
    // A reply from the service is solicited traffic with one delivery path, so
    // the gate lets it through by default; see messageGatePass().
    c->wl_gate_exempt = true;

    // Query responder
    c->query_en = false; // opt-in, like msg_enable
    c->query_rf = true;
    c->query_inet = false; // a question read off the APRS-IS feed is ignored, so it can never key the transmitter
    c->query_aprs_en = true;
    c->query_wx_en = true;
    c->query_igate_en = true;
    c->query_directed_en = true;
    c->query_ext_en = true;
    c->query_min_interval_sec = 30;
    // Opt-in: a channel full of gateways all announcing themselves is exactly
    // what the reply-only default avoids.
    c->query_cap_beacon_en = false;
    c->query_cap_interval_sec = QUERY_CAP_INTERVAL_S_DEFAULT;
    c->query_cap_rf = true;
    c->query_cap_inet = false;
    c->query_cap_extra[0] = 0;
}

// ---- streaming JSON writer -----------------------------------------------
// Each section is serialized by writing tokens straight to its open file, one
// field at a time. Building a cJSON tree of a section in RAM and printing that
// tree into a second full-size string buffer would cost hundreds of tiny cJSON
// nodes plus a contiguous print buffer, all live at once - on this device's
// small, fragmentable heap one of the largest memory events in the firmware,
// enough to drive the "minimum free heap" watermark down sharply on every save.
// Streaming keeps the extra RAM a save needs to essentially just littlefs's own
// write buffer.
//
// The schema has only one object level and single-level (scalar) arrays, so a
// single "need a comma before the next item" flag for each context is enough.
typedef struct {
    FILE *f;
    bool obj_comma; // a member has already been written at object level
    bool arr_comma; // an element has already been written in the current array
} jw_t;

// Emit a number: integers without a decimal point, non-integers at the
// shortest precision that still round-trips (mirrors cJSON's number printer
// closely enough that reload via cJSON_Parse yields the same double).
static void jw_num_val(jw_t *w, double v) {
    if (!isfinite(v)) {
        fputs("0", w->f);
        return;
    }
    if (floor(v) == v && fabs(v) < 1e15) {
        fprintf(w->f, "%.0f", v);
        return;
    }
    char tmp[32];
    for (int prec = 7; prec <= 17; prec++) {
        snprintf(tmp, sizeof(tmp), "%.*g", prec, v);
        if (strtod(tmp, NULL) == v)
            break;
    }
    fputs(tmp, w->f);
}

static void jw_key(jw_t *w, const char *k) {
    if (w->obj_comma)
        fputc(',', w->f);
    w->obj_comma = true;
    json_write_escaped(w->f, k);
    fputc(':', w->f);
}

// Object members. The jadd_*(d, "key", value) call signature is what the
// hundreds of call sites below are written against.
static void jadd_str(jw_t *o, const char *k, const char *v) {
    jw_key(o, k);
    json_write_escaped(o->f, v ? v : "");
}
static void jadd_num(jw_t *o, const char *k, double v) {
    jw_key(o, k);
    jw_num_val(o, v);
}
static void jadd_bool(jw_t *o, const char *k, bool v) {
    jw_key(o, k);
    fputs(v ? "true" : "false", o->f);
}

