hiperiondev/esp32idf_APRS/main/app_config.c
static void section_write_tracker(jw_t *d, const app_config_t *c) {
    fputc('{', d->f);
    jadd_bool(d, "trkEn", c->trk_en);
    jadd_bool(d, "trkPos2rf", c->trk_loc2rf);
    jadd_bool(d, "trkPos2inet", c->trk_loc2inet);
    jadd_bool(d, "trkTime", c->trk_timestamp);
    jadd_num(d, "trkSSID", c->trk_ssid);
    jadd_str(d, "trkMycall", c->trk_mycall);
    jadd_bool(d, "trkUseStation", c->trk_use_station);
    jadd_bool(d, "trkUseGps", c->trk_use_gps);
    jadd_bool(d, "trkUseLiveGps", c->trk_use_live_gps);
    jadd_num(d, "trkPath", c->trk_path);
    jadd_num(d, "trkLAT", c->trk_lat);
    jadd_num(d, "trkLON", c->trk_lon);
    jadd_num(d, "trkALT", c->trk_alt);
    jadd_num(d, "trkINV", c->trk_interval);
    jadd_bool(d, "trkCompress", c->trk_compress);
    jadd_bool(d, "trkPHG", c->trk_phg_enable);
    jadd_bool(d, "trkMice", c->trk_mice);
    jadd_num(d, "trkMiceMsg", c->trk_mice_msg);
    jadd_bool(d, "trkOptAlt", c->trk_altitude);
    jadd_str(d, "trkSymbol", c->trk_symbol);
    jadd_str(d, "trkComment", c->trk_comment);
    jadd_num(d, "trkSTSIntv", c->trk_sts_interval);
    jadd_str(d, "trkStatus", c->trk_status);
    jadd_num(d, "trkFreqMHz", c->trk_freq_mhz);
    jadd_num(d, "trkFreqTone", c->trk_tone_tenths);
    jadd_num(d, "trkFreqDup", c->trk_duplex);
    jadd_num(d, "trkFreqOff", c->trk_offset_khz);
    jadd_bool(d, "trkSbEn", c->trk_sb_enable);
    jadd_num(d, "trkSbSlowIntv", c->trk_sb_slow_interval);
    jadd_num(d, "trkSbFastIntv", c->trk_sb_fast_interval);
    jadd_num(d, "trkSbLowSpd", c->trk_sb_low_speed_kmh);
    jadd_num(d, "trkSbHighSpd", c->trk_sb_high_speed_kmh);
    jadd_num(d, "trkSbTurnAngle", c->trk_sb_turn_angle);
    jadd_num(d, "trkSbTurnSlope", c->trk_sb_turn_slope);
    jadd_num(d, "trkSbMinTurnTime", c->trk_sb_min_turn_time);
    fputc('}', d->f);
}

static void section_write_weather(jw_t *d, const app_config_t *c) {
    fputc('{', d->f);
    jadd_bool(d, "wxEn", c->wx_en);
    jadd_bool(d, "wxTx2rf", c->wx_2rf);
    jadd_bool(d, "wxTx2inet", c->wx_2inet);
    jadd_bool(d, "wxTime", c->wx_timestamp);
    jadd_num(d, "wxSSID", c->wx_ssid);
    jadd_str(d, "wxMycall", c->wx_mycall);
    jadd_bool(d, "wxUseStation", c->wx_use_station);
    jadd_bool(d, "wxUseGps", c->wx_use_gps);
    jadd_num(d, "wxPath", c->wx_path);
    jadd_num(d, "wxLAT", c->wx_lat);
    jadd_num(d, "wxLON", c->wx_lon);
    jadd_num(d, "wxInv", c->wx_interval);
    jadd_str(d, "wxObject", c->wx_object);
    jadd_str(d, "wxComment", c->wx_comment);
    jarr_begin(d, "wxSenEn");
    for (int i = 0; i < WX_SENSOR_NUM; i++)
        jarr_bool(d, c->wx_sensor_enable[i]);
    jarr_end(d);
    jarr_begin(d, "wxSenAvg");
    for (int i = 0; i < WX_SENSOR_NUM; i++)
        jarr_bool(d, c->wx_sensor_avg[i]);
    jarr_end(d);
    // Sensor mappings travel as driver NAMES, not registry positions: a
    // position only means anything within the firmware image that produced it
    // (see the persistence contract in sensors_local.h), so storing the index
    // would re-point all 13 WX fields at different sensors the moment a driver
    // is enabled or disabled in Kconfig. An unmapped field writes "".
    jarr_begin(d, "wxSenCH");
    for (int i = 0; i < WX_SENSOR_NUM; i++)
        jarr_str(d, sensors_local_channel_name(c->wx_sensor_ch[i]));
    jarr_end(d);
    fputc('}', d->f);
}

static void section_write_gps(jw_t *d, const app_config_t *c) {
    fputc('{', d->f);
    jadd_bool(d, "gpsEn", c->gps_en);
    fputc('}', d->f);
}

static void section_write_message(jw_t *d, const app_config_t *c) {
    fputc('{', d->f);
    jadd_bool(d, "msgEnable", c->msg_enable);
    jadd_str(d, "msgMycall", c->msg_mycall);
    jadd_bool(d, "msgUseStation", c->msg_use_station);
    jadd_bool(d, "msgRf", c->msg_rf);
    jadd_bool(d, "msgInet", c->msg_inet);
    jadd_num(d, "msgPath", c->msg_path);
    jadd_num(d, "msgRetry", c->msg_retry);
    jadd_num(d, "msgInterval", c->msg_interval);
    jadd_bool(d, "msgAlarmEn", c->msg_alarm_enable);
    jadd_num(d, "msgAlarmGpio", c->msg_alarm_gpio);
    jarr_begin(d, "msgGroup");
    for (int i = 0; i < 3; i++)
        jarr_str(d, c->msg_group[i]);
    jarr_end(d);
    fputc('}', d->f);
}

static void section_write_winlink(jw_t *d, const app_config_t *c) {
    fputc('{', d->f);
    jadd_bool(d, "wlEnable", c->wl_enable);
    jadd_str(d, "wlServiceCall", c->wl_service_call);
    jadd_str(d, "wlPassword", c->wl_password);
    jadd_bool(d, "wlUseMsgCall", c->wl_use_msg_call);
    jadd_str(d, "wlMyCall", c->wl_mycall);
    jadd_bool(d, "wlAutoLogin", c->wl_auto_login);
    jadd_num(d, "wlSessionMaxMin", c->wl_session_max_min);
    jadd_num(d, "wlPollMin", c->wl_poll_min);
    jadd_bool(d, "wlCommentEn", c->wl_comment_en);
    jadd_bool(d, "wlInetOnly", c->wl_inet_only);
    jadd_bool(d, "wlGateExempt", c->wl_gate_exempt);
    fputc('}', d->f);
}

static void section_write_query(jw_t *d, const app_config_t *c) {
    fputc('{', d->f);
    jadd_bool(d, "queryEn", c->query_en);
    jadd_bool(d, "queryRf", c->query_rf);
    jadd_bool(d, "queryInet", c->query_inet);
    jadd_bool(d, "queryAprsEn", c->query_aprs_en);
    jadd_bool(d, "queryWxEn", c->query_wx_en);
    jadd_bool(d, "queryIgateEn", c->query_igate_en);
    jadd_bool(d, "queryDirectedEn", c->query_directed_en);
    jadd_bool(d, "queryExtEn", c->query_ext_en);
    jadd_num(d, "queryMinInterval", c->query_min_interval_sec);
    jadd_bool(d, "queryCapEn", c->query_cap_beacon_en);
    jadd_num(d, "queryCapIntv", c->query_cap_interval_sec);
    jadd_bool(d, "queryCapRf", c->query_cap_rf);
    jadd_bool(d, "queryCapInet", c->query_cap_inet);
    jadd_str(d, "queryCapExtra", c->query_cap_extra);
    fputc('}', d->f);
}

// ---- deserialize ------------------------------------------------------------

// Bounds a stored "<table><code>" symbol pair to what chapter 21 defines,
// the same two sets the symbol form enforces. Neither byte is cosmetic: the
// table identifier decides how a receiver reads the rest of a compressed
// position report, and the code decides which classifier the report lands in,
// so a byte that arrived from a hand-edited file is folded back to the
// default rather than beaconed.
void app_config_query_cap_extra_sanitize(char *extra) {
    if (extra == NULL)
        return;

    size_t w = 0;
    for (size_t r = 0; extra[r] != 0; r++) {
        char c = extra[r];
        if (c == '\r' || c == '\n' || c == ',' || c == '>')
            continue;
        extra[w++] = c;
    }
    extra[w] = 0;
}

static void clamp_symbol(char *sym, const char *key) {
    if (!aprs_symbol_table_is_valid(sym[0])) {
        ESP_LOGW(TAG, "%s table identifier 0x%02X is not valid, using '%c'", key, (unsigned)(unsigned char)sym[0], APRS_SYMBOL_TABLE_DEFAULT);
        sym[0] = APRS_SYMBOL_TABLE_DEFAULT;
    }
    if (!aprs_symbol_code_is_valid(sym[1])) {
        ESP_LOGW(TAG, "%s code 0x%02X is not valid, using '%c'", key, (unsigned)(unsigned char)sym[1], APRS_SYMBOL_CODE_DEFAULT);
        sym[1] = APRS_SYMBOL_CODE_DEFAULT;
    }
    sym[2] = 0;
}

// Bounds one stored DF report NRQ digit. N, R and Q are a single decimal
// digit each on air, so a wider stored value would push the following bytes
// of the extension out of position for every receiver.
static uint8_t clamp_nrq_digit(double value, const char *key) {
    int v = (int)value;
    if (v < APRS_EXT_DF_NRQ_MIN || v > APRS_EXT_DF_NRQ_MAX) {
        int clamped = (v < APRS_EXT_DF_NRQ_MIN) ? APRS_EXT_DF_NRQ_MIN : APRS_EXT_DF_NRQ_MAX;
        ESP_LOGW(TAG, "%s %d out of range, clamped to %d", key, v, clamped);
        v = clamped;
    }
    return (uint8_t)v;
}

// Bounds one loaded uint16_t field into [min, max], logging and clamping
// a hand-edited value the same way clamp_nrq_digit()
// does for a DF digit. Shared by every SmartBeaconing field below, whose
// bounds are all plain uint16_t ranges.
static uint16_t clamp_u16_range(double value, uint16_t min, uint16_t max, const char *key) {
    long v = (long)value;
    if (v < min || v > max) {
        long clamped = (v < min) ? min : max;
        ESP_LOGW(TAG, "%s %ld out of range (%u-%u), clamped to %ld", key, v, (unsigned)min, (unsigned)max, clamped);
        v = clamped;
    }
    return (uint16_t)v;
}

// Bounds one loaded range-gate radius into [APRS_RANGE_KM_MIN,
// APRS_RANGE_KM_MAX]. A NaN reaching the gate would compare false against
// every threshold and quietly turn the gate off, so it is caught here rather
// than at the comparison: the test is written so that a value which is not
// greater than or equal to the floor - NaN included - takes the floor.
static float clamp_range_km(float value, const char *key) {
    if (!(value >= APRS_RANGE_KM_MIN)) {
        ESP_LOGW(TAG, "%s is not a usable distance, clamped to %.0f km", key, (double)APRS_RANGE_KM_MIN);
        return APRS_RANGE_KM_MIN;
    }
    if (value > APRS_RANGE_KM_MAX) {
        ESP_LOGW(TAG, "%s %.1f km out of range, clamped to %.0f km", key, (double)value, (double)APRS_RANGE_KM_MAX);
        return APRS_RANGE_KM_MAX;
    }
    return value;
}

// One reader per configuration section. Every read takes its fallback from the
// very field it is about to overwrite, and app_config_load() fills the whole
// structure with defaults before the first section file is opened, so a key a
// file does not carry leaves its field at the documented default and a section
// whose file is absent stays entirely at defaults.
//
// A string field's fallback is therefore its own buffer. Both loaders take
// that: set_str() filters in place, and set_str_utf8() copies through a scratch
// buffer before touching the field.

static void section_read_system(cJSON *d, app_config_t *c) {
    c->cpuFreq = (uint8_t)jget_num(d, "cpuFreq", c->cpuFreq);
    c->synctime = jget_bool(d, "syncTime", c->synctime);
    set_str(c->ntp_host[0], sizeof(c->ntp_host[0]), jget_str(d, "ntpHost0", c->ntp_host[0]));
    set_str(c->ntp_host[1], sizeof(c->ntp_host[1]), jget_str(d, "ntpHost1", c->ntp_host[1]));
    set_str(c->ntp_host[2], sizeof(c->ntp_host[2]), jget_str(d, "ntpHost2", c->ntp_host[2]));
    c->ntp_resync_sec = (uint16_t)jget_num(d, "ntpResync", c->ntp_resync_sec);
    if (c->ntp_resync_sec < NTP_RESYNC_MIN_SEC)
        c->ntp_resync_sec = NTP_RESYNC_MIN_SEC;
    c->timezone_idx = (uint8_t)jget_num(d, "timeZone", c->timezone_idx);
    if (c->timezone_idx >= time_sync_tz_count()) {
        ESP_LOGW(TAG, "timeZone %u out of range, clamped to 0 (UTC)", (unsigned)c->timezone_idx);
        c->timezone_idx = 0;
    }
    set_str(c->http_username, sizeof(c->http_username), jget_str(d, "httpUser", c->http_username));
    set_str(c->http_password, sizeof(c->http_password), jget_str(d, "httpPass", c->http_password));
}

static void section_read_station(cJSON *d, app_config_t *c) {
    set_str(c->my_callsign, sizeof(c->my_callsign), jget_str(d, "myCallsign", c->my_callsign));
    c->my_use_gps = jget_bool(d, "myUseGps", c->my_use_gps);
    c->my_lat = (float)jget_num(d, "myLAT", c->my_lat);
    c->my_lon = (float)jget_num(d, "myLON", c->my_lon);
    c->my_alt = (float)jget_num(d, "myALT", c->my_alt);
    c->my_phg_power = (uint16_t)jget_num(d, "myPHGPower", c->my_phg_power);
    c->my_phg_gain = (float)jget_num(d, "myPHGGain", c->my_phg_gain);
    c->my_phg_height = (uint16_t)jget_num(d, "myPHGHeight", c->my_phg_height);
    c->my_phg_dir = (uint8_t)jget_num(d, "myPHGDir", c->my_phg_dir);
    c->pos_ambiguity = (uint8_t)jget_num(d, "myAmbiguity", c->pos_ambiguity);
    if (c->pos_ambiguity > POS_AMBIGUITY_MAX) {
        ESP_LOGW(TAG, "myAmbiguity %u out of range, clamped to %d", (unsigned)c->pos_ambiguity, POS_AMBIGUITY_MAX);
        c->pos_ambiguity = POS_AMBIGUITY_MAX;
    }
    c->status_grid_en = jget_bool(d, "myStatusGrid", c->status_grid_en);
    c->status_timestamp_en = jget_bool(d, "myStatusTS", c->status_timestamp_en);
    {
        // Same two-layer clamp the web form applies, so a hand-edited or
        // imported station.json cannot put a heading or a power on air that the
        // two code characters have no room for. A heading is quantised to the
        // step the field encodes in; anything outside the range switches the
        // block off rather than being folded into an unrelated bearing.
        int beam = (int)jget_num(d, "myStatusBeam", c->status_beam_deg);
        if (beam < 0 || beam > STATUS_BEAM_DEG_MAX) {
            if (beam != STATUS_BEAM_DEG_OFF)
                ESP_LOGW(TAG, "status beam heading %d out of range - beam/ERP block disabled", beam);
            beam = STATUS_BEAM_DEG_OFF;
        } else {
            beam -= beam % STATUS_BEAM_DEG_STEP;
        }
        c->status_beam_deg = (int16_t)beam;

