hiperiondev/esp32idf_APRS/main/app_config.c
        long erp = (long)jget_num(d, "myStatusERP", c->status_erp_watts);
        if (erp < 0)
            erp = 0;
        if (erp > STATUS_ERP_WATTS_MAX) {
            ESP_LOGW(TAG, "status ERP %ld W above the %d W table maximum - clamped", erp, STATUS_ERP_WATTS_MAX);
            erp = STATUS_ERP_WATTS_MAX;
        }
        c->status_erp_watts = (uint16_t)erp;
    }
    c->my_no_archive = jget_bool(d, "myNoArchive", c->my_no_archive);
    c->pos_dao_en = jget_bool(d, "myPosDao", c->pos_dao_en);
}

static void section_read_wireless(cJSON *d, app_config_t *c) {
    c->wifi_mode = (uint8_t)jget_num(d, "WiFiMode", c->wifi_mode);
    // Read through an int so a value the file carries far outside int8_t range
    // is bounded here rather than wrapping into a small negative on the cast:
    // main.c multiplies this by four for the driver's quarter-dBm argument, so
    // anything outside the accepted band either overflows that multiply or is
    // refused by esp_wifi_set_max_tx_power(), silently leaving whatever power
    // the radio came up with.
    int wifiPwr = (int)jget_num(d, "WiFiPwr", c->wifi_power);
    if (wifiPwr < WIFI_TX_POWER_DBM_MIN || wifiPwr > WIFI_TX_POWER_DBM_MAX) {
        ESP_LOGW(TAG, "stored WiFi TX power %d outside %d-%d dBm, clamped", wifiPwr, WIFI_TX_POWER_DBM_MIN, WIFI_TX_POWER_DBM_MAX);
        wifiPwr = (wifiPwr < WIFI_TX_POWER_DBM_MIN) ? WIFI_TX_POWER_DBM_MIN : WIFI_TX_POWER_DBM_MAX;
    }
    c->wifi_power = (int8_t)wifiPwr;
    c->wifi_ap_ch = (uint8_t)jget_num(d, "WiFiAPCH", c->wifi_ap_ch);
    // The file on flash is not a trusted input: it can arrive from a crafted
    // POST, a hand edit over the Storage page, or a backup taken from a build
    // with a different regulatory range. A channel outside WIFI_AP_CH_MIN..MAX
    // is rejected by esp_wifi_set_config(), which would take the access point
    // - the only way back into the device - down with it, so it is folded back
    // to the default here rather than carried into wifi_init().
    if (c->wifi_ap_ch < WIFI_AP_CH_MIN || c->wifi_ap_ch > WIFI_AP_CH_MAX) {
        ESP_LOGW(TAG, "stored SoftAP channel %u outside %u-%u, using %u", (unsigned)c->wifi_ap_ch, (unsigned)WIFI_AP_CH_MIN, (unsigned)WIFI_AP_CH_MAX,
                 (unsigned)WIFI_AP_CH_DEFAULT);
        c->wifi_ap_ch = WIFI_AP_CH_DEFAULT;
    }
    set_str(c->wifi_ap_ssid, sizeof(c->wifi_ap_ssid), jget_str(d, "WiFiAP_SSID", c->wifi_ap_ssid));
    set_str(c->wifi_ap_pass, sizeof(c->wifi_ap_pass), jget_str(d, "WiFiAP_PASS", c->wifi_ap_pass));
    {
        cJSON *arr = cJSON_GetObjectItemCaseSensitive(d, "WiFiSTA");
        if (arr && cJSON_IsArray(arr)) {
            for (int i = 0; i < WIFI_STA_NUM; i++) {
                cJSON *e = cJSON_GetArrayItem(arr, i * 3);
                cJSON *s = cJSON_GetArrayItem(arr, i * 3 + 1);
                cJSON *p = cJSON_GetArrayItem(arr, i * 3 + 2);
                c->wifi_sta[i].enable = e ? cJSON_IsTrue(e) : false;
                set_str(c->wifi_sta[i].wifi_ssid, sizeof(c->wifi_sta[i].wifi_ssid), (s && cJSON_IsString(s)) ? s->valuestring : c->wifi_sta[i].wifi_ssid);
                set_str(c->wifi_sta[i].wifi_pass, sizeof(c->wifi_sta[i].wifi_pass), (p && cJSON_IsString(p)) ? p->valuestring : c->wifi_sta[i].wifi_pass);
            }
        }
    }
}

// Channel-access timing: every value coming off flash is bounded to the same
// range the Radiomodem form accepts (aprs_service.h), so a hand-edited or
// imported radio.json cannot hand aprs_service_build_modem_config() a setting
// the radio should never transmit with - see the note there on what an
// unbounded preamble does to a shared channel.
static void section_read_radio(cJSON *d, app_config_t *c) {
    c->audio_modem_en = jget_bool(d, "audioModemEn", c->audio_modem_en);
    c->audio_lpf = jget_bool(d, "audioLPF", c->audio_lpf);
    c->afsk_modem_type = (uint8_t)jget_num(d, "afskModem", c->afsk_modem_type);
    c->fx25_mode = (uint8_t)jget_num(d, "fx25Mode", c->fx25_mode);
    c->preamble = (uint16_t)jget_num(d, "rfPreamble", c->preamble);
    if (c->preamble < RF_PREAMBLE_MS_MIN || c->preamble > RF_PREAMBLE_MS_MAX) {
        ESP_LOGW(TAG, "rfPreamble %u out of range, clamped to %d..%d ms", (unsigned)c->preamble, RF_PREAMBLE_MS_MIN, RF_PREAMBLE_MS_MAX);
        c->preamble = (c->preamble < RF_PREAMBLE_MS_MIN) ? RF_PREAMBLE_MS_MIN : RF_PREAMBLE_MS_MAX;
    }
    c->rf_tx_buffers = (uint8_t)jget_num(d, "rfTxBuffers", c->rf_tx_buffers);
    if (c->rf_tx_buffers < RF_TX_BUFFERS_MIN)
        c->rf_tx_buffers = RF_TX_BUFFERS_MIN;
    else if (c->rf_tx_buffers > RF_TX_BUFFERS_MAX)
        c->rf_tx_buffers = RF_TX_BUFFERS_MAX;
    c->tx_timeslot = (uint16_t)jget_num(d, "txTimeSlot", c->tx_timeslot);
    if (c->tx_timeslot > RF_TX_TIMESLOT_MS_MAX) {
        ESP_LOGW(TAG, "txTimeSlot %u out of range, clamped to %d ms", (unsigned)c->tx_timeslot, RF_TX_TIMESLOT_MS_MAX);
        c->tx_timeslot = RF_TX_TIMESLOT_MS_MAX;
    }
    c->csma_persist = (uint8_t)jget_num(d, "csmaPersist", c->csma_persist);
    if (c->csma_persist < CSMA_PERSIST_MIN)
        c->csma_persist = CSMA_PERSIST_MIN;
    c->ptt_min_unkey_ms = (uint16_t)jget_num(d, "pttMinUnkeyMs", c->ptt_min_unkey_ms);
    if (c->ptt_min_unkey_ms > PTT_MIN_UNKEY_MS_MAX)
        c->ptt_min_unkey_ms = PTT_MIN_UNKEY_MS_MAX;
    c->duty_cycle_en = jget_bool(d, "dutyCycleEn", c->duty_cycle_en);
    c->duty_cycle_pct = (uint8_t)jget_num(d, "dutyCyclePct", c->duty_cycle_pct);
    if (c->duty_cycle_pct < DUTY_CYCLE_PCT_MIN)
        c->duty_cycle_pct = DUTY_CYCLE_PCT_MIN;
    else if (c->duty_cycle_pct > DUTY_CYCLE_PCT_MAX)
        c->duty_cycle_pct = DUTY_CYCLE_PCT_MAX;
}

static void section_read_igate(cJSON *d, app_config_t *c) {
    c->igate_en = jget_bool(d, "igateEn", c->igate_en);
    c->igate_bcn = jget_bool(d, "igateBcn", c->igate_bcn);
    c->rf2inet = jget_bool(d, "rf2inet", c->rf2inet);
    c->inet2rf = jget_bool(d, "inet2rf", c->inet2rf);
    c->igate_loc2rf = jget_bool(d, "igatePos2rf", c->igate_loc2rf);
    c->igate_loc2inet = jget_bool(d, "igatePos2inet", c->igate_loc2inet);
    c->rf2inetFilter = (uint16_t)jget_num(d, "rf2inetFilter", c->rf2inetFilter);
    c->inet2rfFilter = (uint16_t)jget_num(d, "inet2rfFilter", c->inet2rfFilter);
    c->rf2inet_budlist_mode = (budlist_mode_t)jget_num(d, "rf2inetBudlistMode", c->rf2inet_budlist_mode);
    c->inet2rf_budlist_mode = (budlist_mode_t)jget_num(d, "inet2rfBudlistMode", c->inet2rf_budlist_mode);
    {
        cJSON *bl = cJSON_GetObjectItemCaseSensitive(d, "budlist");
        for (int i = 0; i < IGATE_BUDLIST_MAX; i++) {
            cJSON *v = bl ? cJSON_GetArrayItem(bl, i) : NULL;
            set_str(c->budlist[i], sizeof(c->budlist[i]), (v && cJSON_IsString(v)) ? v->valuestring : c->budlist[i]);
        }
    }
    {
        cJSON *sg = cJSON_GetObjectItemCaseSensitive(d, "satgate");
        for (int i = 0; i < IGATE_SATGATE_MAX; i++) {
            cJSON *v = sg ? cJSON_GetArrayItem(sg, i) : NULL;
            set_str(c->satgate[i], sizeof(c->satgate[i]), (v && cJSON_IsString(v)) ? v->valuestring : c->satgate[i]);
        }
    }
    c->dup_cache_size = (uint8_t)jget_num(d, "dupCacheSize", c->dup_cache_size);
    if (c->dup_cache_size < DUP_CACHE_SIZE_MIN || c->dup_cache_size > DUP_CACHE_SIZE_MAX) {
        ESP_LOGW(TAG, "dupCacheSize %u out of range, clamped to %d..%d", (unsigned)c->dup_cache_size, DUP_CACHE_SIZE_MIN, DUP_CACHE_SIZE_MAX);
        c->dup_cache_size = (c->dup_cache_size < DUP_CACHE_SIZE_MIN) ? DUP_CACHE_SIZE_MIN : DUP_CACHE_SIZE_MAX;
    }
    c->dup_cache_timeout_ms = (uint32_t)jget_num(d, "dupCacheTimeoutMs", c->dup_cache_timeout_ms);
    if (c->dup_cache_timeout_ms < DUP_CACHE_TIMEOUT_MS_MIN || c->dup_cache_timeout_ms > DUP_CACHE_TIMEOUT_MS_MAX) {
        ESP_LOGW(TAG, "dupCacheTimeoutMs %u out of range, clamped to %d..%d ms", (unsigned)c->dup_cache_timeout_ms, DUP_CACHE_TIMEOUT_MS_MIN,
                 DUP_CACHE_TIMEOUT_MS_MAX);
        c->dup_cache_timeout_ms = (c->dup_cache_timeout_ms < DUP_CACHE_TIMEOUT_MS_MIN) ? DUP_CACHE_TIMEOUT_MS_MIN : DUP_CACHE_TIMEOUT_MS_MAX;
    }
    // Both range gates take the same two-layer clamp the rest of the bounded
    // numerics use: the form emits min/max, and the file on flash is checked
    // again on the way in because it is not a trusted input.
    c->rf2inet_range_en = jget_bool(d, "rf2inetRangeEn", c->rf2inet_range_en);
    c->rf2inet_range_km = clamp_range_km((float)jget_num(d, "rf2inetRangeKm", c->rf2inet_range_km), "rf2inetRangeKm");
    c->rf2inet_prefix_en = jget_bool(d, "rf2inetPrefixEn", c->rf2inet_prefix_en);
    set_str(c->rf2inet_prefixes, sizeof(c->rf2inet_prefixes), jget_str(d, "rf2inetPrefixes", c->rf2inet_prefixes));
    c->inet2rf_range_en = jget_bool(d, "inet2rfRangeEn", c->inet2rf_range_en);
    c->inet2rf_range_km = clamp_range_km((float)jget_num(d, "inet2rfRangeKm", c->inet2rf_range_km), "inet2rfRangeKm");
    c->inet2rf_3rdparty_unwrap_en = jget_bool(d, "inet2rf3rdPartyUnwrapEn", c->inet2rf_3rdparty_unwrap_en);
    c->igate_msg_gate_en = jget_bool(d, "igateMsgGateEn", c->igate_msg_gate_en);
    // Same two-layer clamp the rest of the bounded fields use: the file on
    // flash is not a trusted input, and a window of zero would stop the
    // gateway putting any message on the air while a window of days would
    // keep transmitting to stations that left the area hours ago.
    c->igate_local_window_sec = (uint16_t)jget_num(d, "igateLocalWindowSec", c->igate_local_window_sec);
    if (c->igate_local_window_sec < IGATE_LOCAL_WINDOW_SEC_MIN || c->igate_local_window_sec > IGATE_LOCAL_WINDOW_SEC_MAX) {
        ESP_LOGW(TAG, "igateLocalWindowSec %u out of range, clamped to %d..%d s", (unsigned)c->igate_local_window_sec, IGATE_LOCAL_WINDOW_SEC_MIN,
                 IGATE_LOCAL_WINDOW_SEC_MAX);
        c->igate_local_window_sec = (c->igate_local_window_sec < IGATE_LOCAL_WINDOW_SEC_MIN) ? IGATE_LOCAL_WINDOW_SEC_MIN : IGATE_LOCAL_WINDOW_SEC_MAX;
    }
    // The hop limit takes the same treatment, read through an int so a stored
    // value outside the field's own range is caught before the narrowing cast
    // rather than after it: a limit longer than an AX.25 path can carry would
    // gate to stations no transmission from here can reach.
    {
        int maxHops = (int)jget_num(d, "igateMsgMaxHops", c->igate_msg_max_hops);
        if (maxHops < IGATE_MSG_MAX_HOPS_MIN || maxHops > IGATE_MSG_MAX_HOPS_MAX) {
            ESP_LOGW(TAG, "igateMsgMaxHops %d out of range, clamped to %d..%d hops", maxHops, IGATE_MSG_MAX_HOPS_MIN, IGATE_MSG_MAX_HOPS_MAX);
            maxHops = (maxHops < IGATE_MSG_MAX_HOPS_MIN) ? IGATE_MSG_MAX_HOPS_MIN : IGATE_MSG_MAX_HOPS_MAX;
        }
        c->igate_msg_max_hops = (uint8_t)maxHops;
    }
    c->aprs_ssid = (uint8_t)jget_num(d, "igateSSID", c->aprs_ssid);
    {
        cJSON *arr = cJSON_GetObjectItemCaseSensitive(d, "igateServers");
        if (arr && cJSON_IsArray(arr)) {
            for (int i = 0; i < APRS_SERVER_NUM; i++) {
                cJSON *e = cJSON_GetArrayItem(arr, i * 3);
                cJSON *h = cJSON_GetArrayItem(arr, i * 3 + 1);
                cJSON *p = cJSON_GetArrayItem(arr, i * 3 + 2);
                c->aprs_server[i].enable = e ? cJSON_IsTrue(e) : c->aprs_server[i].enable;
                set_str(c->aprs_server[i].host, sizeof(c->aprs_server[i].host), (h && cJSON_IsString(h)) ? h->valuestring : c->aprs_server[i].host);
                c->aprs_server[i].port = (uint16_t)((p && cJSON_IsNumber(p)) ? p->valuedouble : c->aprs_server[i].port);
                // Same two-layer clamp as the SoftAP channel above: the file
                // on flash is not a trusted input, and port 0 would send the
                // IGate into a reconnect loop against an address it can
                // never connect to. Only the low bound needs testing:
                // APRS_PORT_MAX is the full range of the uint16_t the value
                // is already narrowed to.
                if (c->aprs_server[i].port < APRS_PORT_MIN) {
                    ESP_LOGW(TAG, "stored APRS-IS server %d port %u outside %u-%u, using %u", i, (unsigned)c->aprs_server[i].port, (unsigned)APRS_PORT_MIN,
                             (unsigned)APRS_PORT_MAX, (unsigned)APRS_PORT_DEFAULT);
                    c->aprs_server[i].port = APRS_PORT_DEFAULT;
                }
            }
        }
    }
    set_str(c->aprs_mycall, sizeof(c->aprs_mycall), jget_str(d, "igateMycall", c->aprs_mycall));
    c->igate_use_station = jget_bool(d, "igateUseStation", c->igate_use_station);
    c->igate_use_gps = jget_bool(d, "igateUseGps", c->igate_use_gps);
    set_str(c->aprs_passcode, sizeof(c->aprs_passcode), jget_str(d, "igatePasscode", c->aprs_passcode));
    set_str(c->aprs_filter, sizeof(c->aprs_filter), jget_str(d, "igateFilter", c->aprs_filter));
    c->igate_log_after_filters = jget_bool(d, "igateLogAfterFilters", c->igate_log_after_filters);
    c->igate_lat = (float)jget_num(d, "igateLAT", c->igate_lat);
    c->igate_lon = (float)jget_num(d, "igateLON", c->igate_lon);
    c->igate_alt = (float)jget_num(d, "igateALT", c->igate_alt);
    c->igate_interval = (uint16_t)jget_num(d, "igateINV", c->igate_interval);
    set_str(c->igate_symbol, sizeof(c->igate_symbol), jget_str(d, "igateSymbol", c->igate_symbol));
    clamp_symbol(c->igate_symbol, "igateSymbol");
    c->igate_path = (uint8_t)jget_num(d, "igatePath", c->igate_path);
    set_str_utf8(c->igate_comment, sizeof(c->igate_comment), jget_str(d, "igateComment", c->igate_comment));
    c->igate_sts_interval = (uint16_t)jget_num(d, "igateSTSIntv", c->igate_sts_interval);
    set_str_utf8(c->igate_status, sizeof(c->igate_status), jget_str(d, "igateStatus", c->igate_status));
    c->igate_timestamp = jget_bool(d, "igateTimestamp", c->igate_timestamp);
    c->igate_compress = jget_bool(d, "igateCompress", c->igate_compress);
    c->igate_phg_enable = jget_bool(d, "igatePHGEn", c->igate_phg_enable);
    c->igate_phg_use_station = jget_bool(d, "igatePHGUseStation", c->igate_phg_use_station);
    c->igate_phg_power = (uint16_t)jget_num(d, "igatePHGPower", c->igate_phg_power);
    c->igate_phg_gain = (float)jget_num(d, "igatePHGGain", c->igate_phg_gain);
    c->igate_phg_height = (uint16_t)jget_num(d, "igatePHGHeight", c->igate_phg_height);
    c->igate_phg_dir = (uint8_t)jget_num(d, "igatePHGDir", c->igate_phg_dir);
    c->igate_ext_type = (uint8_t)jget_num(d, "igateExtType", c->igate_ext_type);
    if (c->igate_ext_type > APRS_EXT_DF) {
        ESP_LOGW(TAG, "igateExtType %u unknown, using PHG", (unsigned)c->igate_ext_type);
        c->igate_ext_type = APRS_EXT_PHG;
    }
    c->igate_range_miles = (uint16_t)jget_num(d, "igateRng", c->igate_range_miles);
    if (c->igate_range_miles > APRS_EXT_RANGE_MILES_MAX) {
        ESP_LOGW(TAG, "igateRng %u out of range, clamped to %d", (unsigned)c->igate_range_miles, APRS_EXT_RANGE_MILES_MAX);
        c->igate_range_miles = APRS_EXT_RANGE_MILES_MAX;
    }
    c->igate_dfs_strength = (uint8_t)jget_num(d, "igateDfsS", c->igate_dfs_strength);
    if (c->igate_dfs_strength > APRS_EXT_DFS_STRENGTH_MAX) {
        ESP_LOGW(TAG, "igateDfsS %u out of range, clamped to %d", (unsigned)c->igate_dfs_strength, APRS_EXT_DFS_STRENGTH_MAX);
        c->igate_dfs_strength = APRS_EXT_DFS_STRENGTH_MAX;
    }
    {
        // The bearing wraps rather than clamps: 360 degrees and 0 degrees name
        // the same direction, and the on-air field is three digits, so a value
        // outside the range still has one correct reading.
        int brg = (int)jget_num(d, "igateDfBrg", c->igate_df_bearing);
        int wrapped = brg % 360;
        if (wrapped < 0)
            wrapped += 360;
        if (wrapped != brg)
            ESP_LOGW(TAG, "igateDfBrg %d out of range, wrapped to %d", brg, wrapped);
        c->igate_df_bearing = (uint16_t)wrapped;
    }
    c->igate_df_nrq_n = clamp_nrq_digit(jget_num(d, "igateDfN", c->igate_df_nrq_n), "igateDfN");
    c->igate_df_nrq_r = clamp_nrq_digit(jget_num(d, "igateDfR", c->igate_df_nrq_r), "igateDfR");
    c->igate_df_nrq_q = clamp_nrq_digit(jget_num(d, "igateDfQ", c->igate_df_nrq_q), "igateDfQ");
    c->igate_freq_mhz = (float)jget_num(d, "igateFreqMHz", c->igate_freq_mhz);
    c->igate_tone_tenths = (uint16_t)jget_num(d, "igateFreqTone", c->igate_tone_tenths);
    c->igate_duplex = (int8_t)jget_num(d, "igateFreqDup", c->igate_duplex);
    c->igate_offset_khz = (uint16_t)jget_num(d, "igateFreqOff", c->igate_offset_khz);
}

// Read after the IGate section (see the section table), because the interlock
// below is a decision about the gating the IGate file carries.
static void section_read_brandmeister(cJSON *d, app_config_t *c) {
    c->bm_en = jget_bool(d, "bmEn", c->bm_en);
    c->bm_monitor = jget_bool(d, "bmMonitor", c->bm_monitor);
    c->bm_msg_inet_only = jget_bool(d, "bmMsgInetOnly", c->bm_msg_inet_only);
    {
        cJSON *gw = cJSON_GetObjectItemCaseSensitive(d, "bmGateways");
        for (int i = 0; i < APRS_BM_GATEWAYS_MAX; i++) {
            cJSON *v = gw ? cJSON_GetArrayItem(gw, i) : NULL;
            set_str(c->bm_gateways[i], sizeof(c->bm_gateways[i]), (v && cJSON_IsString(v)) ? v->valuestring : c->bm_gateways[i]);
        }
    }

    // The interlock the BrandMeister page enforces on save is re-applied here,
    // for the same reason every other bounded field is re-checked on load: a
    // brandmeister.json edited by hand or carried over from another station can
    // arrive with the worldwide monitor subscription on and nothing standing
    // between that feed and the transmitter. Turning the monitor flag off
    // rather than the gating is the conservative direction - it withdraws the
    // subscription the operator would otherwise be told to add, and leaves
    // every other setting as written.
    if (c->bm_monitor && c->inet2rf && !c->inet2rf_range_en) {
        ESP_LOGW(TAG, "bmMonitor requires the INET->RF range gate while inet2rf is on - monitor disabled");
        c->bm_monitor = false;
    }
}

static void section_read_digipeater(cJSON *d, app_config_t *c) {
    c->digi_en = jget_bool(d, "digiEn", c->digi_en);
    c->digi_loc2rf = jget_bool(d, "digiPos2rf", c->digi_loc2rf);
    c->digi_loc2inet = jget_bool(d, "digiPos2inet", c->digi_loc2inet);
    c->digi_timestamp = jget_bool(d, "digiTime", c->digi_timestamp);
    c->digi_ssid = (uint8_t)jget_num(d, "digiSSID", c->digi_ssid);
    set_str(c->digi_mycall, sizeof(c->digi_mycall), jget_str(d, "digiMycall", c->digi_mycall));
    c->digi_use_station = jget_bool(d, "digiUseStation", c->digi_use_station);
    c->digi_use_gps = jget_bool(d, "digiUseGps", c->digi_use_gps);
    c->digi_path = (uint8_t)jget_num(d, "digiPath", c->digi_path);
    // Alias table: three parallel arrays, one row per index, following the
    // same shape as the budlist/satgate lists in the IGate section. A row is
    // validated on the way in rather than trusted: an out-of-range hop limit
    // or an unknown mode would otherwise decide how this station repeats other
    // people's traffic.
    {
        cJSON *al = cJSON_GetObjectItemCaseSensitive(d, "digiAlias");
        cJSON *an = cJSON_GetObjectItemCaseSensitive(d, "digiAliasMaxN");
        cJSON *am = cJSON_GetObjectItemCaseSensitive(d, "digiAliasMode");
        for (int i = 0; i < DIGI_ALIAS_MAX; i++) {
            cJSON *v = al ? cJSON_GetArrayItem(al, i) : NULL;
            set_str(c->digi_alias[i].alias, sizeof(c->digi_alias[i].alias), (v && cJSON_IsString(v)) ? v->valuestring : c->digi_alias[i].alias);

