hiperiondev/esp32idf_APRS/main/app_config.c
            cJSON *n = an ? cJSON_GetArrayItem(an, i) : NULL;
            c->digi_alias[i].max_n = (uint8_t)((n && cJSON_IsNumber(n)) ? n->valuedouble : c->digi_alias[i].max_n);
            if (c->digi_alias[i].max_n < 1 || c->digi_alias[i].max_n > DIGI_ALIAS_MAX_N) {
                ESP_LOGW(TAG, "digiAliasMaxN[%d] %u out of range, clamped to 1..%d", i, (unsigned)c->digi_alias[i].max_n, DIGI_ALIAS_MAX_N);
                c->digi_alias[i].max_n = (c->digi_alias[i].max_n < 1) ? 1 : DIGI_ALIAS_MAX_N;
            }

            cJSON *m = am ? cJSON_GetArrayItem(am, i) : NULL;
            c->digi_alias[i].mode = (uint8_t)((m && cJSON_IsNumber(m)) ? m->valuedouble : c->digi_alias[i].mode);
            if (c->digi_alias[i].mode != DIGI_ALIAS_OFF && c->digi_alias[i].mode != DIGI_ALIAS_TRACE && c->digi_alias[i].mode != DIGI_ALIAS_FLOOD) {
                ESP_LOGW(TAG, "digiAliasMode[%d] %u unknown, row disabled", i, (unsigned)c->digi_alias[i].mode);
                c->digi_alias[i].mode = DIGI_ALIAS_OFF;
            }
        }
    }
    c->digi_fillin_only = jget_bool(d, "digiFillinOnly", c->digi_fillin_only);
    c->digi_trap_n_clamp = jget_bool(d, "digiTrapNClamp", c->digi_trap_n_clamp);
    c->digi_dest_ssid_en = jget_bool(d, "digiDestSsidEn", c->digi_dest_ssid_en);
    c->digi_preempt = (uint8_t)jget_num(d, "digiPreempt", c->digi_preempt);
    if (c->digi_preempt != DIGI_PREEMPT_OFF && c->digi_preempt != DIGI_PREEMPT_DROP && c->digi_preempt != DIGI_PREEMPT_MARK) {
        ESP_LOGW(TAG, "digiPreempt %u unknown, preemptive digipeating disabled", (unsigned)c->digi_preempt);
        c->digi_preempt = DIGI_PREEMPT_OFF;
    }
    c->digi_bcn = jget_bool(d, "digiBcn", c->digi_bcn);
    c->digi_compress = jget_bool(d, "digiCompress", c->digi_compress);
    c->digi_alt = (float)jget_num(d, "digiAlt", c->digi_alt);
    c->digi_lat = (float)jget_num(d, "digiLAT", c->digi_lat);
    c->digi_lon = (float)jget_num(d, "digiLON", c->digi_lon);
    c->digi_interval = (uint16_t)jget_num(d, "digiINV", c->digi_interval);
    set_str(c->digi_symbol, sizeof(c->digi_symbol), jget_str(d, "digiSymbol", c->digi_symbol));
    clamp_symbol(c->digi_symbol, "digiSymbol");
    set_str_utf8(c->digi_comment, sizeof(c->digi_comment), jget_str(d, "digiComment", c->digi_comment));
    c->digi_sts_interval = (uint16_t)jget_num(d, "digiSTSIntv", c->digi_sts_interval);
    set_str_utf8(c->digi_status, sizeof(c->digi_status), jget_str(d, "digiStatus", c->digi_status));
    c->digi_phg_enable = jget_bool(d, "digiPHGEn", c->digi_phg_enable);
    c->digi_phg_use_station = jget_bool(d, "digiPHGUseStation", c->digi_phg_use_station);
    c->digi_phg_power = (uint16_t)jget_num(d, "digiPHGPower", c->digi_phg_power);
    c->digi_phg_gain = (float)jget_num(d, "digiPHGGain", c->digi_phg_gain);
    c->digi_phg_height = (uint16_t)jget_num(d, "digiPHGHeight", c->digi_phg_height);
    c->digi_phg_dir = (uint8_t)jget_num(d, "digiPHGDir", c->digi_phg_dir);
    c->digi_ext_type = (uint8_t)jget_num(d, "digiExtType", c->digi_ext_type);
    if (c->digi_ext_type > APRS_EXT_DF) {
        ESP_LOGW(TAG, "digiExtType %u unknown, using PHG", (unsigned)c->digi_ext_type);
        c->digi_ext_type = APRS_EXT_PHG;
    }
    c->digi_range_miles = (uint16_t)jget_num(d, "digiRng", c->digi_range_miles);
    if (c->digi_range_miles > APRS_EXT_RANGE_MILES_MAX) {
        ESP_LOGW(TAG, "digiRng %u out of range, clamped to %d", (unsigned)c->digi_range_miles, APRS_EXT_RANGE_MILES_MAX);
        c->digi_range_miles = APRS_EXT_RANGE_MILES_MAX;
    }
    c->digi_dfs_strength = (uint8_t)jget_num(d, "digiDfsS", c->digi_dfs_strength);
    if (c->digi_dfs_strength > APRS_EXT_DFS_STRENGTH_MAX) {
        ESP_LOGW(TAG, "digiDfsS %u out of range, clamped to %d", (unsigned)c->digi_dfs_strength, APRS_EXT_DFS_STRENGTH_MAX);
        c->digi_dfs_strength = APRS_EXT_DFS_STRENGTH_MAX;
    }
    {
        // The bearing wraps rather than clamps: 360 degrees and 0 degrees name
        // the same direction, and the on-air field is three digits, so a value
        // outside the range still has one correct reading.
        int brg = (int)jget_num(d, "digiDfBrg", c->digi_df_bearing);
        int wrapped = brg % 360;
        if (wrapped < 0)
            wrapped += 360;
        if (wrapped != brg)
            ESP_LOGW(TAG, "digiDfBrg %d out of range, wrapped to %d", brg, wrapped);
        c->digi_df_bearing = (uint16_t)wrapped;
    }
    c->digi_df_nrq_n = clamp_nrq_digit(jget_num(d, "digiDfN", c->digi_df_nrq_n), "digiDfN");
    c->digi_df_nrq_r = clamp_nrq_digit(jget_num(d, "digiDfR", c->digi_df_nrq_r), "digiDfR");
    c->digi_df_nrq_q = clamp_nrq_digit(jget_num(d, "digiDfQ", c->digi_df_nrq_q), "digiDfQ");
    c->digi_freq_mhz = (float)jget_num(d, "digiFreqMHz", c->digi_freq_mhz);
    c->digi_tone_tenths = (uint16_t)jget_num(d, "digiFreqTone", c->digi_tone_tenths);
    c->digi_duplex = (int8_t)jget_num(d, "digiFreqDup", c->digi_duplex);
    c->digi_offset_khz = (uint16_t)jget_num(d, "digiFreqOff", c->digi_offset_khz);
    {
        cJSON *p = cJSON_GetObjectItemCaseSensitive(d, "path");
        for (int i = 0; i < 4; i++) {
            cJSON *v = p ? cJSON_GetArrayItem(p, i) : NULL;
            set_str(c->path[i], sizeof(c->path[i]), (v && cJSON_IsString(v)) ? v->valuestring : c->path[i]);
        }
    }
}

static void section_read_tracker(cJSON *d, app_config_t *c) {
    c->trk_en = jget_bool(d, "trkEn", c->trk_en);
    c->trk_loc2rf = jget_bool(d, "trkPos2rf", c->trk_loc2rf);
    c->trk_loc2inet = jget_bool(d, "trkPos2inet", c->trk_loc2inet);
    c->trk_timestamp = jget_bool(d, "trkTime", c->trk_timestamp);
    c->trk_ssid = (uint8_t)jget_num(d, "trkSSID", c->trk_ssid);
    set_str(c->trk_mycall, sizeof(c->trk_mycall), jget_str(d, "trkMycall", c->trk_mycall));
    c->trk_use_station = jget_bool(d, "trkUseStation", c->trk_use_station);
    c->trk_use_gps = jget_bool(d, "trkUseGps", c->trk_use_gps);
    c->trk_use_live_gps = jget_bool(d, "trkUseLiveGps", c->trk_use_live_gps);
    c->trk_path = (uint8_t)jget_num(d, "trkPath", c->trk_path);
    c->trk_lat = (float)jget_num(d, "trkLAT", c->trk_lat);
    c->trk_lon = (float)jget_num(d, "trkLON", c->trk_lon);
    c->trk_alt = (float)jget_num(d, "trkALT", c->trk_alt);
    c->trk_interval = (uint16_t)jget_num(d, "trkINV", c->trk_interval);
    c->trk_compress = jget_bool(d, "trkCompress", c->trk_compress);
    c->trk_phg_enable = jget_bool(d, "trkPHG", c->trk_phg_enable);
    c->trk_mice = jget_bool(d, "trkMice", c->trk_mice);
    c->trk_mice_msg = (uint8_t)jget_num(d, "trkMiceMsg", c->trk_mice_msg);
    // Same two-layer clamp every other bounded field uses: the form handler
    // bounds what the operator can send, and this bounds what a hand-edited
    // tracker.json can carry into the beacon builder.
    if (c->trk_mice_msg > MICE_POS_COMMENT_MAX) {
        ESP_LOGW(TAG, "trkMiceMsg %u out of range (0-%d) - using %d", (unsigned)c->trk_mice_msg, MICE_POS_COMMENT_MAX, MICE_POS_COMMENT_DEFAULT);
        c->trk_mice_msg = MICE_POS_COMMENT_DEFAULT;
    }
    c->trk_altitude = jget_bool(d, "trkOptAlt", c->trk_altitude);
    set_str(c->trk_symbol, sizeof(c->trk_symbol), jget_str(d, "trkSymbol", c->trk_symbol));
    clamp_symbol(c->trk_symbol, "trkSymbol");
    set_str_utf8(c->trk_comment, sizeof(c->trk_comment), jget_str(d, "trkComment", c->trk_comment));
    c->trk_sts_interval = (uint16_t)jget_num(d, "trkSTSIntv", c->trk_sts_interval);
    set_str_utf8(c->trk_status, sizeof(c->trk_status), jget_str(d, "trkStatus", c->trk_status));
    c->trk_freq_mhz = (float)jget_num(d, "trkFreqMHz", c->trk_freq_mhz);
    c->trk_tone_tenths = (uint16_t)jget_num(d, "trkFreqTone", c->trk_tone_tenths);
    c->trk_duplex = (int8_t)jget_num(d, "trkFreqDup", c->trk_duplex);
    c->trk_offset_khz = (uint16_t)jget_num(d, "trkFreqOff", c->trk_offset_khz);

