hiperiondev/esp32idf_APRS/main/app_config.c
    c->trk_sb_enable = jget_bool(d, "trkSbEn", c->trk_sb_enable);
    c->trk_sb_slow_interval =
        clamp_u16_range(jget_num(d, "trkSbSlowIntv", c->trk_sb_slow_interval), TRK_SB_SLOW_INTERVAL_S_MIN, TRK_SB_SLOW_INTERVAL_S_MAX, "trkSbSlowIntv");
    c->trk_sb_fast_interval =
        clamp_u16_range(jget_num(d, "trkSbFastIntv", c->trk_sb_fast_interval), TRK_SB_FAST_INTERVAL_S_MIN, TRK_SB_FAST_INTERVAL_S_MAX, "trkSbFastIntv");
    c->trk_sb_low_speed_kmh = clamp_u16_range(jget_num(d, "trkSbLowSpd", c->trk_sb_low_speed_kmh), TRK_SB_SPEED_KMH_MIN, TRK_SB_SPEED_KMH_MAX, "trkSbLowSpd");
    c->trk_sb_high_speed_kmh =
        clamp_u16_range(jget_num(d, "trkSbHighSpd", c->trk_sb_high_speed_kmh), TRK_SB_SPEED_KMH_MIN, TRK_SB_SPEED_KMH_MAX, "trkSbHighSpd");
    if (c->trk_sb_high_speed_kmh < c->trk_sb_low_speed_kmh) {
        ESP_LOGW(TAG, "trkSbHighSpd %u below trkSbLowSpd %u, raised to match", (unsigned)c->trk_sb_high_speed_kmh, (unsigned)c->trk_sb_low_speed_kmh);
        c->trk_sb_high_speed_kmh = c->trk_sb_low_speed_kmh;
    }
    c->trk_sb_turn_angle = clamp_u16_range(jget_num(d, "trkSbTurnAngle", c->trk_sb_turn_angle), TRK_SB_TURN_ANGLE_MIN, TRK_SB_TURN_ANGLE_MAX, "trkSbTurnAngle");
    c->trk_sb_turn_slope = clamp_u16_range(jget_num(d, "trkSbTurnSlope", c->trk_sb_turn_slope), TRK_SB_TURN_SLOPE_MIN, TRK_SB_TURN_SLOPE_MAX, "trkSbTurnSlope");
    c->trk_sb_min_turn_time =
        clamp_u16_range(jget_num(d, "trkSbMinTurnTime", c->trk_sb_min_turn_time), TRK_SB_MIN_TURN_TIME_S_MIN, TRK_SB_MIN_TURN_TIME_S_MAX, "trkSbMinTurnTime");
}

static void section_read_weather(cJSON *d, app_config_t *c) {
    c->wx_en = jget_bool(d, "wxEn", c->wx_en);
    c->wx_2rf = jget_bool(d, "wxTx2rf", c->wx_2rf);
    c->wx_2inet = jget_bool(d, "wxTx2inet", c->wx_2inet);
    c->wx_timestamp = jget_bool(d, "wxTime", c->wx_timestamp);
    c->wx_ssid = (uint8_t)jget_num(d, "wxSSID", c->wx_ssid);
    set_str(c->wx_mycall, sizeof(c->wx_mycall), jget_str(d, "wxMycall", c->wx_mycall));
    c->wx_use_station = jget_bool(d, "wxUseStation", c->wx_use_station);
    c->wx_use_gps = jget_bool(d, "wxUseGps", c->wx_use_gps);
    c->wx_path = (uint8_t)jget_num(d, "wxPath", c->wx_path);
    c->wx_lat = (float)jget_num(d, "wxLAT", c->wx_lat);
    c->wx_lon = (float)jget_num(d, "wxLON", c->wx_lon);
    c->wx_interval = (uint16_t)jget_num(d, "wxInv", c->wx_interval);
    set_str(c->wx_object, sizeof(c->wx_object), jget_str(d, "wxObject", c->wx_object));
    set_str_utf8(c->wx_comment, sizeof(c->wx_comment), jget_str(d, "wxComment", c->wx_comment));
    {
        cJSON *a1 = cJSON_GetObjectItemCaseSensitive(d, "wxSenEn"), *a2 = cJSON_GetObjectItemCaseSensitive(d, "wxSenAvg"),
              *a3 = cJSON_GetObjectItemCaseSensitive(d, "wxSenCH");
        for (int i = 0; i < WX_SENSOR_NUM; i++) {
            cJSON *v;
            if (a1 && (v = cJSON_GetArrayItem(a1, i)))
                c->wx_sensor_enable[i] = cJSON_IsTrue(v);
            if (a2 && (v = cJSON_GetArrayItem(a2, i)))
                c->wx_sensor_avg[i] = cJSON_IsTrue(v);
            if (a3 && (v = cJSON_GetArrayItem(a3, i)) && cJSON_IsString(v)) {
                // Driver name (see the writer above): resolve it against the
                // registry this image actually built. A name that is not
                // registered leaves the field unmapped and says so, rather
                // than aiming it at whatever sensor now sits at that position.
                c->wx_sensor_ch[i] = sensors_local_channel_from_name(v->valuestring);
                if (c->wx_sensor_ch[i] == SENSOR_LOCAL_CH_NONE && v->valuestring != NULL && v->valuestring[0] != 0)
                    ESP_LOGW(TAG, "WX field %d: sensor '%s' is not registered, left unmapped", i, v->valuestring);
            }
        }
    }
}

static void section_read_gps(cJSON *d, app_config_t *c) {
    c->gps_en = jget_bool(d, "gpsEn", c->gps_en);
}

static void section_read_message(cJSON *d, app_config_t *c) {
    c->msg_enable = jget_bool(d, "msgEnable", c->msg_enable);
    set_str(c->msg_mycall, sizeof(c->msg_mycall), jget_str(d, "msgMycall", c->msg_mycall));
    c->msg_use_station = jget_bool(d, "msgUseStation", c->msg_use_station);
    c->msg_rf = jget_bool(d, "msgRf", c->msg_rf);
    c->msg_inet = jget_bool(d, "msgInet", c->msg_inet);
    c->msg_path = (uint8_t)jget_num(d, "msgPath", c->msg_path);
    c->msg_retry = (uint8_t)jget_num(d, "msgRetry", c->msg_retry);
    c->msg_interval = (uint16_t)jget_num(d, "msgInterval", c->msg_interval);
    c->msg_alarm_enable = jget_bool(d, "msgAlarmEn", c->msg_alarm_enable);
    c->msg_alarm_gpio = (int8_t)jget_num(d, "msgAlarmGpio", c->msg_alarm_gpio);
    {
        cJSON *g = cJSON_GetObjectItemCaseSensitive(d, "msgGroup");
        for (int i = 0; i < 3; i++) {
            cJSON *v = g ? cJSON_GetArrayItem(g, i) : NULL;
            set_str(c->msg_group[i], sizeof(c->msg_group[i]), (v && cJSON_IsString(v)) ? v->valuestring : c->msg_group[i]);
        }
    }
}

static void section_read_winlink(cJSON *d, app_config_t *c) {
    c->wl_enable = jget_bool(d, "wlEnable", c->wl_enable);
    set_str(c->wl_service_call, sizeof(c->wl_service_call), jget_str(d, "wlServiceCall", c->wl_service_call));
    if (c->wl_service_call[0] == 0)
        set_str(c->wl_service_call, sizeof(c->wl_service_call), WL_SERVICE_CALL_DEFAULT);
    set_str(c->wl_password, sizeof(c->wl_password), jget_str(d, "wlPassword", c->wl_password));
    c->wl_use_msg_call = jget_bool(d, "wlUseMsgCall", c->wl_use_msg_call);
    set_str(c->wl_mycall, sizeof(c->wl_mycall), jget_str(d, "wlMyCall", c->wl_mycall));
    c->wl_auto_login = jget_bool(d, "wlAutoLogin", c->wl_auto_login);
    {
        int mins = (int)jget_num(d, "wlSessionMaxMin", c->wl_session_max_min);
        if (mins < WL_SESSION_MAX_MIN_MIN || mins > WL_SESSION_MAX_MIN_MAX) {
            int clamped = (mins < WL_SESSION_MAX_MIN_MIN) ? WL_SESSION_MAX_MIN_MIN : WL_SESSION_MAX_MIN_MAX;
            ESP_LOGW(TAG, "wlSessionMaxMin %d out of range, clamped to %d", mins, clamped);
            mins = clamped;
        }
        c->wl_session_max_min = (uint16_t)mins;
    }
    {
        int mins = (int)jget_num(d, "wlPollMin", c->wl_poll_min);
        if (mins < WL_POLL_MIN_MIN || mins > WL_POLL_MIN_MAX) {
            int clamped = (mins < WL_POLL_MIN_MIN) ? WL_POLL_MIN_MIN : WL_POLL_MIN_MAX;
            ESP_LOGW(TAG, "wlPollMin %d out of range, clamped to %d", mins, clamped);
            mins = clamped;
        }
        c->wl_poll_min = (uint16_t)mins;
    }
    c->wl_comment_en = jget_bool(d, "wlCommentEn", c->wl_comment_en);
    c->wl_inet_only = jget_bool(d, "wlInetOnly", c->wl_inet_only);
    c->wl_gate_exempt = jget_bool(d, "wlGateExempt", c->wl_gate_exempt);
}

static void section_read_query(cJSON *d, app_config_t *c) {
    c->query_en = jget_bool(d, "queryEn", c->query_en);
    c->query_rf = jget_bool(d, "queryRf", c->query_rf);
    c->query_inet = jget_bool(d, "queryInet", c->query_inet);
    c->query_aprs_en = jget_bool(d, "queryAprsEn", c->query_aprs_en);
    c->query_wx_en = jget_bool(d, "queryWxEn", c->query_wx_en);
    c->query_igate_en = jget_bool(d, "queryIgateEn", c->query_igate_en);
    c->query_directed_en = jget_bool(d, "queryDirectedEn", c->query_directed_en);
    c->query_ext_en = jget_bool(d, "queryExtEn", c->query_ext_en);
    c->query_min_interval_sec = (uint16_t)jget_num(d, "queryMinInterval", c->query_min_interval_sec);
    if (c->query_min_interval_sec < 5) // floor: airtime/loop safety, matches the webconfig page's own clamp
        c->query_min_interval_sec = 5;
    c->query_cap_beacon_en = jget_bool(d, "queryCapEn", c->query_cap_beacon_en);
    {
        int iv = (int)jget_num(d, "queryCapIntv", c->query_cap_interval_sec);
        if (iv < QUERY_CAP_INTERVAL_S_MIN || iv > QUERY_CAP_INTERVAL_S_MAX) {
            int clamped = (iv < QUERY_CAP_INTERVAL_S_MIN) ? QUERY_CAP_INTERVAL_S_MIN : QUERY_CAP_INTERVAL_S_MAX;
            ESP_LOGW(TAG, "queryCapIntv %d out of range, clamped to %d", iv, clamped);
            iv = clamped;
        }
        c->query_cap_interval_sec = (uint32_t)iv;
    }
    c->query_cap_rf = jget_bool(d, "queryCapRf", c->query_cap_rf);
    c->query_cap_inet = jget_bool(d, "queryCapInet", c->query_cap_inet);
    set_str_utf8(c->query_cap_extra, sizeof(c->query_cap_extra), jget_str(d, "queryCapExtra", c->query_cap_extra));
    app_config_query_cap_extra_sanitize(c->query_cap_extra);
}

// ---- section table ---------------------------------------------------------

// One row per web admin functionality that owns persistent settings, in the
// order app_config_load() reads them. The order matters in one place: the
// BrandMeister reader re-applies the monitor interlock against the INET->RF
// gating the IGate section carries, so IGate is read first.
static const config_section_desc_t SECTIONS[APP_CONFIG_SECTION_NUM] = {
    [APP_CONFIG_SECTION_SYSTEM] = { STORAGE_BASE_PATH "/system.json", STORAGE_BASE_PATH "/system.json.tmp", "system configuration", section_write_system,
                                    section_read_system },
    [APP_CONFIG_SECTION_STATION] = { STORAGE_BASE_PATH "/station.json", STORAGE_BASE_PATH "/station.json.tmp", "station configuration", section_write_station,
                                     section_read_station },
    [APP_CONFIG_SECTION_WIRELESS] = { STORAGE_BASE_PATH "/wireless.json", STORAGE_BASE_PATH "/wireless.json.tmp", "wireless configuration",
                                      section_write_wireless, section_read_wireless },
    [APP_CONFIG_SECTION_RADIO] = { STORAGE_BASE_PATH "/radio.json", STORAGE_BASE_PATH "/radio.json.tmp", "radiomodem configuration", section_write_radio,
                                   section_read_radio },
    [APP_CONFIG_SECTION_IGATE] = { STORAGE_BASE_PATH "/igate.json", STORAGE_BASE_PATH "/igate.json.tmp", "igate configuration", section_write_igate,
                                   section_read_igate },
    [APP_CONFIG_SECTION_BRANDMEISTER] = { STORAGE_BASE_PATH "/brandmeister.json", STORAGE_BASE_PATH "/brandmeister.json.tmp", "brandmeister configuration",
                                          section_write_brandmeister, section_read_brandmeister },
    [APP_CONFIG_SECTION_DIGIPEATER] = { STORAGE_BASE_PATH "/digi.json", STORAGE_BASE_PATH "/digi.json.tmp", "digipeater configuration",
                                        section_write_digipeater, section_read_digipeater },
    [APP_CONFIG_SECTION_TRACKER] = { STORAGE_BASE_PATH "/tracker.json", STORAGE_BASE_PATH "/tracker.json.tmp", "tracker configuration", section_write_tracker,
                                     section_read_tracker },
    [APP_CONFIG_SECTION_WEATHER] = { STORAGE_BASE_PATH "/weather.json", STORAGE_BASE_PATH "/weather.json.tmp", "weather configuration", section_write_weather,
                                     section_read_weather },
    [APP_CONFIG_SECTION_GPS] = { STORAGE_BASE_PATH "/gps.json", STORAGE_BASE_PATH "/gps.json.tmp", "gps configuration", section_write_gps, section_read_gps },
    [APP_CONFIG_SECTION_MESSAGE] = { STORAGE_BASE_PATH "/message.json", STORAGE_BASE_PATH "/message.json.tmp", "message configuration", section_write_message,
                                     section_read_message },
    [APP_CONFIG_SECTION_WINLINK] = { STORAGE_BASE_PATH "/winlink.json", STORAGE_BASE_PATH "/winlink.json.tmp", "winlink configuration", section_write_winlink,
                                     section_read_winlink },
    [APP_CONFIG_SECTION_QUERY] = { STORAGE_BASE_PATH "/query.json", STORAGE_BASE_PATH "/query.json.tmp", "query configuration", section_write_query,
                                   section_read_query },
};

