hiperiondev/esp32idf_APRS/main/app_config.c
const char *app_config_section_path(app_config_section_t section) {
    if (section >= APP_CONFIG_SECTION_NUM)
        return NULL;
    return SECTIONS[section].path;
}

// Writes one section's file. The caller must hold both the save mutex and
// storage_write_lock(): the first is what json_store_open_tmp() checks before
// pinning the shared stdio buffer, the second keeps the temp-file + rename
// sequence off any other subsystem's write and off a whole-partition erase.
static bool save_section_locked(app_config_section_t section, SemaphoreHandle_t lock) {
    const config_section_desc_t *sec = &SECTIONS[section];

    FILE *f = json_store_open_tmp(sec->tmp_path, TAG, lock);
    if (!f)
        return false;

    jw_t w = { .f = f, .obj_comma = false, .arr_comma = false };
    sec->write(&w, &g_config);

    return json_store_commit(f, sec->tmp_path, sec->path, TAG, sec->what);
}

bool app_config_save_sections(uint32_t mask) {
    // Streams each selected section straight to its own file, one field at a
    // time - see the note on the JSON writer above for why no in-RAM document
    // is built.
    //
    // Serialize the whole save against any other save/load in flight (see
    // s_config_mutex comment above). Block indefinitely: a save must never be
    // silently dropped, and the critical section below is short.
    //
    // The handle is taken once and reused for the rest of the function, so the
    // stream handed out by json_store_open_tmp() is checked against the very
    // mutex this task holds.
    SemaphoreHandle_t lock = config_mutex();
    if (!lock) {
        ESP_LOGE(TAG, "save mutex unavailable (out of memory), configuration not written");
        return false;
    }
    xSemaphoreTake(lock, portMAX_DELAY);

    // Second, filesystem-wide gate (storage.h): config_mutex() only keeps two
    // configuration saves apart, while the temp-file + rename sequence below
    // must also not overlap the whole-partition erase the web Storage page can
    // trigger, nor a save being made by another subsystem. Module lock first,
    // this gate second - the order storage.h's contract requires. It is taken
    // once around the whole run rather than per file, so a multi-section save
    // reaches flash as one uninterrupted sequence.
    storage_write_lock();

    // Every selected section is attempted even after one has failed, so a
    // single full filesystem does not leave the remaining files holding
    // settings the operator has already replaced in RAM.
    bool ok = true;
    for (app_config_section_t s = 0; s < APP_CONFIG_SECTION_NUM; s++) {
        if (!(mask & APP_CONFIG_SECTION_BIT(s)))
            continue;
        if (!save_section_locked(s, lock))
            ok = false;
    }

    // How close the calling task (normally the httpd task) came to overflowing
    // its stack during this save, so the config.stack_size in web_server.c can
    // be sized from real numbers instead of a guess.
    ESP_LOGI(TAG, "Caller stack high-water mark: %u bytes free", (unsigned)(uxTaskGetStackHighWaterMark(NULL) * sizeof(StackType_t)));
    storage_write_unlock();
    xSemaphoreGive(lock);
    return ok;
}

bool app_config_save_section(app_config_section_t section) {
    if (section >= APP_CONFIG_SECTION_NUM)
        return false;
    return app_config_save_sections(APP_CONFIG_SECTION_BIT(section));
}

bool app_config_save(void) {
    return app_config_save_sections(APP_CONFIG_SECTIONS_ALL);
}

// Reads one section's file into g_config. The three outcomes the caller has to
// tell apart are folded into the two-flag return: a section that was read,
// a section whose file has to be created, and a section whose file is believed
// intact but could not be read this pass.
//
// A missing, empty or unparseable file all mean the same thing here: the
// section is left at the defaults app_config_load() has already put in place
// and its file is rewritten from them, so every functionality always has a
// file on flash and the device always comes up on a reachable web admin. An
// out-of-memory read is the one case that must not write: the file is very
// probably fine, so overwriting it on the strength of a failed malloc would
// destroy a good configuration.
static bool load_section(app_config_section_t section, bool *out_transient) {
    const config_section_desc_t *sec = &SECTIONS[section];

    cJSON *doc = NULL;
    json_store_status_t st = json_store_read(sec->path, TAG, sec->what, &doc);

    if (st == JSON_STORE_OOM) {
        *out_transient = true;
        return false;
    }

    if (st != JSON_STORE_OK) {
        ESP_LOGW(TAG, "%s unusable, writing defaults", sec->path);
        return false;
    }

    sec->read(doc, &g_config);
    cJSON_Delete(doc);
    return true;
}

bool app_config_load(void) {
    // Bracketed because this is one of the larger single transients in the
    // firmware and none of it is visible from outside: each file is read whole
    // into a buffer and then parsed into a cJSON tree, both of which are alive
    // at once for the length of that section's parse. The "after" line is
    // placed on every exit path so a load that gave the memory back and a load
    // that failed holding it are told apart by the pair, not by which line
    // happens to follow in the log.
    HEAP_MONITOR_BRACKET("before", "config load");

    // Defaults first, once, for the whole structure: every section reader
    // takes each field's fallback from the field itself, so a key a file does
    // not carry - and a section whose file does not exist at all - is left at
    // the documented default rather than at zero-garbage.
    app_config_set_defaults(&g_config);

    uint32_t rewrite = 0;
    bool transient = false;
    for (app_config_section_t s = 0; s < APP_CONFIG_SECTION_NUM; s++) {
        bool section_transient = false;
        if (!load_section(s, &section_transient)) {
            if (section_transient)
                transient = true;
            else
                rewrite |= APP_CONFIG_SECTION_BIT(s);
        }
    }

    // A section that could not be read for want of memory says nothing about
    // its content, so nothing is written this pass and the caller is told to
    // try again: main.c retries once and falls back to the factory set only if
    // the second attempt fails too. Rewriting the sections that are genuinely
    // absent or corrupt would be safe on its own, but doing it while another
    // section is still unread would persist a configuration assembled half
    // from flash and half from defaults.
    if (transient) {
        HEAP_MONITOR_BRACKET("after", "config load");
        return false;
    }

