hiperiondev/esp32idf_APRS/main/app_config.c
    // Every file that does not exist yet, or that could not be parsed, is
    // created from the defaults now, so a first boot and a boot after a
    // partition format both end with one file per functionality on flash.
    bool ok = true;
    if (rewrite != 0)
        ok = app_config_save_sections(rewrite);

    HEAP_MONITOR_BRACKET("after", "config load");
    ESP_LOGI(TAG, "Configuration loaded");
    return ok;
}

bool app_config_factory_reset(void) {
    // Web-reachable (/default) at runtime, so it rewrites the whole g_config
    // out from under the beacon/igate/message tasks. Hold the data lock across
    // the wholesale rewrite so no reader can sample a half-reset struct; drop
    // it before the (slow, self-locking) flash save.
    app_config_lock();
    app_config_set_defaults(&g_config);
    app_config_unlock();
    return app_config_save();
}

uint8_t app_config_path_preset_hops(const char *preset) {
    if (preset == NULL || !preset[0])
        return 0;

    uint8_t hops = 1; // the alias itself is at least 1 hop
    for (const char *p = preset; *p; p++)
        if (*p == ',')
            hops++;
    return hops;
}

uint8_t app_config_path_hop_count(uint8_t pathBitmask, const char pathPreset[4][72]) {
    uint8_t hops = 0;
    for (int bit = 0; bit < 4; bit++) {
        if (!(pathBitmask & (1u << bit)))
            continue;
        hops += app_config_path_preset_hops(pathPreset[bit]);
    }
    return hops;
}

uint8_t app_config_path_mask_clamp(uint8_t pathBitmask, const char pathPreset[4][72]) {
    if (app_config_path_hop_count(pathBitmask, pathPreset) <= 8)
        return pathBitmask; // within budget already - nothing to drop

    // Over AX.25's 8-via limit once every selected preset's own comma-joined
    // hops are counted (e.g. two 4-hop presets can exceed 8 well before all 4
    // checkboxes are ticked). Keep presets low-bit-first until the budget is
    // used up and drop the rest, instead of silently saving a bitmask that
    // would later be clipped differently (or reach further than intended) at
    // transmit time - see aprs_path_build_suffix(), which enforces the same
    // limit again as a belt-and-suspenders check for a configuration that
    // reached the device without passing through this form.
    uint8_t clamped = 0;
    uint8_t hopsUsed = 0;
    for (int bit = 0; bit < 4; bit++) {
        if (!(pathBitmask & (1u << bit)) || !pathPreset[bit][0])
            continue;

        uint8_t presetHops = 1;
        for (const char *p = pathPreset[bit]; *p; p++)
            if (*p == ',')
                presetHops++;

        if (hopsUsed + presetHops > 8) {
            ESP_LOGW(TAG, "path bitmask 0x%02X exceeds AX.25 8-hop limit, dropping preset %d and beyond", pathBitmask, bit + 1);
            break;
        }
        clamped |= (uint8_t)(1u << bit);
        hopsUsed += presetHops;
    }
    return clamped;
}
